{
  "section_number": 2,
  "title": "2. Game Play Errors",
  "section_key": "ipg_section_2",
  "metadata": {
    "effective_date": "September 23, 2024"
  },
  "infractions": [
    {
      "number": "2.1",
      "title": "Game Play Error — Missed Trigger No Penalty",
      "penalty": "No Penalty",
      "definition": "A triggered ability triggers, but the player controlling the ability doesn’t demonstrate awareness\nof the trigger’s existence by the first time that it would affect the game in a visible fashion.\nThe point by which the player needs to demonstrate this awareness depends on the impact that\nthe trigger would have on the game:\n• A triggered ability that requires its controller to choose targets (other than 'target\nopponent'), modes, or other choices made when the ability is put onto the stack: The\ncontroller must announce those choices before they next pass priority.\n• A triggered ability that causes a change in the visible game state (including life\ntotals) or requires a choice upon resolution: The controller must take the appropriate\nphysical action or acknowledge the specific trigger before taking any game actions (such\nas casting a sorcery spell or explicitly taking an action in the next step or phase) that can\nbe taken only after the triggered ability should have resolved. Note that passing priority,\ncasting an instant spell or activating an ability doesn’t mean a triggered ability has been\nforgotten, as it could still be on the stack.\n• A triggered ability that changes the rules of the game: The controller must\nacknowledge the trigger or stop an opponent who tries to take any resulting illegal action.\n• A triggered ability that affects the game state in non-visible ways: The controller\nmust make the change known by the first time the change has an effect on the visible\ngame state.\nOnce any of the above obligations has been fulfilled, further problems are treated as a Game Play\nError — Game Rule Violation.\nIf the turn-based action of putting a lore counter on a Saga is missed, it should be handled as\nthough it was a missed trigger.\nTriggered abilities that do nothing except create delayed triggered abilities automatically resolve\nwithout requiring acknowledgment. Awareness of the resulting delayed trigger must be\ndemonstrated at the appropriate point. Triggered abilities that do nothing except create one or\nmore copies of a spell or ability (such as storm or cipher) automatically resolve, but awareness of\nthe resulting objects must be demonstrated using the same requirements as described above\n(even though the objects may not be triggered abilities).\nAbilities consisting of an action followed by “when you do” in the same ability are considered\ncommunicated by the announcement of the action. This is most commonly the case for exert and\nsimilar abilities.\nIf a triggered ability would have no impact on the game, it’s not an infraction to fail to\ndemonstrate awareness of it. For example, if the effect of a triggered ability instructs its\ncontroller to sacrifice a creature, a player who controls no creatures isn’t required to demonstrate\nawareness of the ability. Similarly, a player demonstrating awareness of an optional trigger with\nno visible effect is assumed to have made the affirmative choice unless the opponent responds.\nJudges do not intervene in a missed trigger situation unless they intend to issue a Warning or\nhave reason to suspect that the controller is intentionally missing their triggered abilities.\nA player controlling another player is responsible for that player’s triggers in addition to their\nown.",
      "examples": [
        "A. Knight of Infamy (a 2/1 creature with exalted) attacks alone. Its controller says “Take\ntwo.”",
        "B. A player forgets to remove the final time counter from a suspended spell and then draws\na card during their draw step.",
        "C. A player casts Manic Vandal, then forgets its triggered ability by not choosing a target for\nit. They realize this only after casting another spell.",
        "D. A player forgets to exile the Angel token created by Geist of Saint Traft at end of combat.\nThey realize the error when declaring blockers during the next turn."
      ],
      "philosophy": "Triggered abilities are common and invisible, so players should not be harshly penalized when\nforgetting about one. Players are expected to remember their own triggered abilities;\nintentionally ignoring one may be Unsporting Conduct — Cheating (unless the ability would\nhave no impact on the game as described above). Even if an opponent is involved in the\nannouncement or resolution of the ability, the controller is still responsible for ensuring the\nopponents make the appropriate choices and take the appropriate actions. Opponents are not\nrequired to point out triggered abilities that they do not control, though they may do so if they\nwish.\nTriggered abilities are assumed to be remembered until otherwise indicated, and the impact on\nthe game state may not be immediately apparent. The opponent’s benefit is in not having to point\nout triggered abilities, although this does not mean that they can cause triggers to be missed. If\nan opponent requires information about the precise timing of a triggered ability or needs details\nabout a game object that may be affected by a resolved triggered ability, that player may need to\nacknowledge that ability’s existence before its controller does. A player who makes a play that\nmay or may not be legal depending on whether an opponent’s uncommunicated trigger has been\nremembered has not committed an infraction; their play either succeeds, confirming that the\ntrigger has been missed, or is rewound.\nPlayers may not cause triggered abilities controlled by an opponent to be missed by taking game\nactions or otherwise prematurely advancing the game. During an opponent’s turn, if a trigger’s\ncontroller demonstrates awareness of the trigger before they take an active role (such as taking\nan action or explicitly passing priority), the trigger is remembered. The Out-of-Order Sequencing\nrules (MTR section 4.3) may also be applicable, especially as they relate to batches of actions or\nresolving items on the stack in an improper order.\nA triggered ability is considered to have triggered even if it was subsequently missed. Effects\nthat count or restrict the number of times a triggered ability can trigger will count the missed one.",
      "additional_remedy": "If the triggered ability is an enters-the-battlefield trigger of an Aura that affects only the\nenchanted permanent and causes a visible change to that permanent, resolve the ability\nimmediately.\nIf the triggered ability is a delayed triggered ability that undoes a zone change (including token\ncreation) caused by the effect that created the delayed triggered ability, the opponent chooses\nwhether to resolve the ability the next time a player would get priority or when a player would\nget priority at the start of the next phase. The new zone does not need to be the same as the one\nthe card was originally moved from.\nFor all other triggered abilities, if the ability was missed prior to the current phase in the previous\nturn, instruct the players to continue playing. If the triggered ability created an effect whose\nduration has already expired, instruct the players to continue playing.\nIf the triggered ability isn’t covered by the previous paragraphs, the opponent chooses whether\nthe triggered ability is added to the stack. If it is, it’s inserted at the appropriate place on the stack\nif possible or on the bottom of the stack. No player may make choices for the triggered ability\ninvolving objects that would not have been legal choices when the ability should have triggered.\nFor example, if the ability instructs a player to sacrifice a creature, that player can't sacrifice a\ncreature that wasn't on the battlefield when the ability should have triggered.\nIf the player is in the process of, or has just completed, an action that indicates the trigger has\nbeen missed, and completing that action would change the effect of the trigger, a simple backup\nmay be performed on that action.\nUpgrade: If the triggered ability is usually considered detrimental for the controlling player and\nthey own the card responsible for the existence of the trigger, the penalty is a Warning. The\ncurrent game state is not a factor in determining this, though symmetrical abilities (such as\nHowling Mine) may be considered usually detrimental or not depending on who is being\naffected.",
      "upgrade": null
    },
    {
      "number": "2.2",
      "title": "Game Play Error — Looking at Extra Cards Warning",
      "penalty": "Warning",
      "definition": "A player takes an action that may have enabled them to see the faces of cards that they were not\nentitled to see.\nThis penalty is applied only once if one or more cards are seen in the same action or sequence of\nactions.",
      "examples": [
        "A. A player accidentally reveals (drops, flips over) a card while shuffling their opponent’s\nlibrary.",
        "B. A player pulls up an extra card while drawing from their library.",
        "C. A player sees the bottom card of their deck when presenting it to their opponent for\ncutting/shuffling."
      ],
      "philosophy": "A player can accidentally look at extra cards easily and this infraction handles situations where a\ndexterity or rules error has led to a player seeing cards that they shouldn’t have. Cards in a\nlibrary are considered to be there until they touch cards in another hidden set. Once those cards\nhave joined another hidden set, the infraction is Hidden Card Error or Game Rule Violation.\nPlayers should not use this penalty to get a “free shuffle” or to attempt to shuffle away cards they\ndon’t want to draw; doing so may be Unsporting Conduct — Cheating. Players also are not\nallowed to use this penalty as a stalling mechanism. The library is already randomized, so\nshuffling in the revealed cards should not involve excessive effort.",
      "additional_remedy": "If the cards were in the library, shuffle any previously unknown cards from a deck back into the\nrandom portion of the library, then put any previously known cards back in their correct\nlocations.",
      "upgrade": null
    },
    {
      "number": "2.3",
      "title": "Game Play Error — Hidden Card Error Warning",
      "penalty": "Warning",
      "definition": "A player commits an error in the game that cannot be corrected by only publicly available\ninformation. It is not a Hidden Card Error if the opponent acknowledges the action or controls\nthe continuous effect modifying the game rule that made the action illegal. This infraction only\napplies when a card whose identity is known to only one player is in a hidden set of cards both\nbefore and after the error.\nIf an additional card is seen but not added to the set, the infraction is Game Play Error —\nLooking at Extra Cards.",
      "examples": [
        "A. A player draws four cards after casting Ancestral Recall.",
        "B. A player scries two cards when they should only have scried one.",
        "C. A player resolves a Dark Confidant trigger, but forgets to reveal the card before putting it\ninto their hand.",
        "D. A player has more cards in their hand than can be accounted for.",
        "E. A player casts Anticipate and picks up the top four cards of their library.",
        "F. A player, going first, draws for their turn."
      ],
      "philosophy": "Though the game state cannot be reversed to the ‘correct’ state, this error can be mitigated by\ngiving the opponent sufficient knowledge and ability to offset the error so that it is less likely to\ngenerate advantage.\nIf cards are placed into a public zone, then their order is known and the infraction can be handled\nas a Game Rule Violation. Order cannot be determined from card faces only visible to one player\nunless the card is in a uniquely identifiable position (such as on top of the library, or as the only\ncard in hand.)\nBe careful not to apply this infraction in situations where a publicly-correctable error\nsubsequently leads to an uncorrectable situation\nsuch as a Brainstorm cast using green mana. In\nthese situations, the infraction is based on that root cause.\nInformation about cards previously known by the opponent, such as cards previously revealed\nwhile on the top of the library or by a previous look at the hand, may be taken into account while\ndetermining the set of cards to which the remedy applies.\nAlways operate on the smallest set possible to remedy the error. This may mean applying the\nremedy to only part of a set defined by an instruction. For example, if a player resolves Collected\nCompany, picks up three cards with one hand and then four cards with the other, the last drawn\nset of four cards should be used for the remedy, instead of the full set of seven cards..",
      "additional_remedy": "In cases where the infraction was immediately followed by moving a card from the affected set\nto a known location, such as by discarding, putting cards on top of the library, or playing a land,\na simple backup to the point just after the error may be performed.\nIf the set of cards that contained the problem no longer exists, there is no remedy to be applied.\nIf the error put cards into a set prematurely and other operations involving cards in the set should\nhave been performed first, the player reveals the set of cards that contains the excess and their\nopponent chooses a number of previously-unknown cards. Put those cards aside until the point at\nwhich they should have been legally added, then return them to the set.\nIf the error involves one or more cards that were supposed to be revealed, the player reveals the\nset of cards that contains the unrevealed cards and their opponent chooses that many previously-\nunknown cards. Treat those as the cards that were ‘revealed’ and return them to the set that was\nbeing selected from; the player then reperforms the action. If recreating the original selection set\nand reperforming the action would be too disruptive, leave the selected cards in hand.\nIf a set affected by the error contains more cards than it is supposed to contain, the player reveals\nthe set of cards that contains the excess and their opponent chooses a number of previously-\nunknown cards sufficient to reduce the set to the correct size. These excess cards are returned to\nthe correct location. If that location is the library, they should be shuffled into the random portion\nunless the owner previously knew the identity of the card/cards illegally moved; that many cards,\nchosen by the opponent, are returned to the original location instead. For example, if a player\nplaying with Sphinx of Jwar Isle illegally draws a card, that card should be returned to the top of\nthe library.\nUpgrade: If a face-down card cast using a morph or disguise ability is on the battlefield during\nthe game and does not have the relevant ability printed on the card, the penalty is a Game Loss.\nIf the player has one or more cards with the same ability in hand, has not added previously\nunknown cards to their hand since casting the card found in violation, and has self-reported the\nerror before an effect that would reveal it is played, the upgrade does not apply and they may\nswap the card for a card with the appropriate ability in hand.",
      "upgrade": null
    },
    {
      "number": "2.4",
      "title": "Game Play Error — Mulligan Procedure Error Warning",
      "penalty": "Warning",
      "definition": "A player makes an error in one of the steps of the mulligan process. Once the mulligan process is\ncomplete and the game begins, excess cards arising from an improper mulligan is a Game Play\nError — Hidden Card Error and too few cards is a Game Play Error — Game Rule Violation.\nUnintentional process errors that provide no advantage, such as declaring an intent to mulligan\nearly or exiling too many cards to Serum Powder, are not an infraction.",
      "examples": [
        "A. A player draws eight cards at the start of the game (instead of seven).",
        "B. A player chooses to not take a mulligan then takes a mulligan after seeing their opponent\nchoose to take a mulligan."
      ],
      "philosophy": "Errors prior to the beginning of the game have a less disruptive option—a forced mulligan —that\nis not available at any other point during the game.",
      "additional_remedy": "The player takes an additional mulligan.",
      "upgrade": null
    },
    {
      "number": "2.5",
      "title": "Game Play Error — Game Rule Violation Warning",
      "penalty": "Warning",
      "definition": "This infraction covers the majority of game situations in which a player makes an error or fails to\nfollow a game procedure correctly. It handles violations of the Comprehensive Rules that are not\ncovered by the other Game Play Errors.",
      "examples": [
        "A. A player casts Wrath of God for 3W (actual cost 2WW).",
        "B. A player does not attack with a creature that must attack each turn.",
        "C. A player fails to put a creature with lethal damage into a graveyard and it is not noticed\nuntil several turns later.",
        "D. A Phyrexian Revoker is on the battlefield that should have had a card named for it.",
        "E. A player casts Brainstorm and forgets to put two cards back on top of their library."
      ],
      "philosophy": "While Game Rule Violations can be attributed to one player, they usually occur publicly and\nboth players are expected to be mindful of what is happening in the game. It is tempting to try\nand “fix” these errors, but it is important that they be handled consistently, regardless of their\nimpact on the game.",
      "additional_remedy": "First, consider a simple backup (see section 1.4).\nIf a simple backup is not sufficient and the infraction falls into one or more of the following\ncategories, and only into those categories, perform the appropriate partial fix:\n• If a player forgot to untap one or more permanents at the start of their turn and it is still\nthe same turn, untap them.\n• If a player made an illegal choice (including no choice where required) for a static ability\ngenerating a continuous effect still on the battlefield, that player makes a legal choice.\n• If a player failed to draw cards, discard cards, or return cards from their hand to another\nzone, that player does so.\n• If an object is not in the correct zone, the exact object is still known to all players, and it\ncan be moved with only minor disruption to the current state of the game, put the object\nin the correct zone. This only applies if the object being in the wrong zone is the Game\nRule Violation, and not if it is the consequence of a different error.\n• If damage assignment order has not been declared, the appropriate player chooses that\norder.\nFor each of these fixes, a simple backup may be performed beforehand if it makes applying the\nfix smoother. Triggered abilities are generated from these partial fixes only if they would have\noccurred had the action been taken at the correct time.\nOtherwise, a full backup may be considered or the game state may be left as is.\nIf the game has proceeded past a point where an opponent could reasonably be expected to notice\nthe error, the opponent has also committed an infraction. In most cases, the infraction is Game\nPlay Error — Failure to Maintain Game State. However, i f the judge believes that both players\nwere responsible for the Game Rule Violation, such as due to the opponent controlling the\ncontinuous effect modifying the rules of the game that led to the Game Rule Violation or a\nplayer taking action based on another player’s instruction, they have instead committed a Game\nPlay Error — Game Rule Violation. For example, if a player casts Path to Exile on an\nopponent’s creature and the opponent puts the creature into the graveyard, once the game has\ncontinued both players will have committed a Game Rule Violation.",
      "upgrade": null
    },
    {
      "number": "2.6",
      "title": "Game Play Error — Failure to Maintain Game State Warning",
      "penalty": "Warning",
      "definition": "A player allows another player in the game to commit a Game Play Error and does not point it\nout immediately. If a judge believes a player is intentionally not pointing out other players’\nillegal actions, either for their own advantage, or in the hope of bringing it up at a more\nstrategically advantageous time, they should consider an Unsporting Conduct — Cheating\ninfraction. Not reminding an opponent about their triggered abilities is never Failure to Maintain\nGame State nor Cheating.",
      "examples": [
        "A. A player’s opponent forgets to reveal the card searched for by Worldly Tutor. It is not\nnoticed until the end of turn.",
        "B. A player does not notice that their opponent has Armadillo Cloak on a creature with\nprotection from green."
      ],
      "philosophy": "If an error is caught before a player could gain advantage, then the dangers of the ongoing game\nstate becoming corrupted are much lower. If the error is allowed to persist, at least some of the\nfault lies with the opponent, who has also failed to notice the error.",
      "additional_remedy": null,
      "upgrade": null
    }
  ]
}