{
  "section_number": 3,
  "title": "3. Tournament Rules",
  "section_key": "mtr_section_3",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "3.1",
      "title": "Tiebreakers",
      "content": "The following tiebreakers are used to determine how a player ranks in a tournament:\n\n1. Match points\n2. Opponents’ match-win percentage\n3. Game-win percentage\n4. Opponents’ game-win percentage\n\nDefinitions of these tiebreakers can be found in Appendix C. Not all of these tiebreakers may be used in formats with single-game matches."
    },
    {
      "number": "3.2",
      "title": "Format Categories",
      "content": "Wizards of the Coast sanctions the following formats as individual, three-person team, or Two-Headed Giant tournaments:\n\nConstructed Formats\n\n• Standard\n• Pioneer\n• Modern Eternal Constructed Formats\n\n• Vintage\n• Legacy\n\nLimited Formats\n\n• Sealed Deck\n• Booster Draft (individual and Two-Headed Giant only)\n• Rochester Draft (three-person team only)"
    },
    {
      "number": "3.3",
      "title": "Authorized Cards",
      "content": "Players may use any Authorized Magic Game Cards from Magic: The Gathering expansions, core sets, special sets, supplements, and promotional printings. Authorized Game Cards must be regulation-sized, genuine Magic cards publicly released by Wizards of the Coast. Cards that are not Authorized Game Cards are prohibited in all sanctioned events.\n\nCards that, unaltered, feature gold borders on their front or back, and cards from the “Heroes of the Realm” and Theros block “Challenge Deck” series (usually denoted by a different card back), are not Authorized Game Cards.\n\nSilver-bordered cards and cards with an acorn-shaped security stamp or acorn-shaped symbol may only be used in casual events and only when the format explicitly permits them.\n\nCards labeled “Not for constructed play,” “Playtest”, or featuring a playtest sticker or picture of a playtest sticker on another Magic card may not be used in Constructed events. Wizards includes additional game material in packs, intended as game aids and not as traditional cards. Examples include tokens, title cards, dungeons, and art cards. These are not required for play and players are welcome to use any representation that is clear to both players when they are needed in the game.\n\nPlayers may use otherwise-legal non-English and/or misprinted cards provided they are not using them to create an advantage by using misleading text or pictures. Official promotional textless spells are allowed in sanctioned Magic tournaments in which they would otherwise be legal.\n\nArtistic modifications are acceptable in sanctioned tournaments, provided that the modifications do not make the card art unrecognizable, contain substantial strategic advice, disparaging remarks, or contain offensive images. Artistic modifications also may not cover or change the mana cost or name of the card. The Head Judge is the final authority on acceptable cards for a tournament. If a player is required to replace a card in their deck and is unable to find a replacement, the player may replace the card with a card named Plains, Island, Swamp, Mountain, or Forest of their choice. This also applies to cards that are lost and must be replaced to have a legal deck.\n\nThe Head Judge of a tournament may issue a proxy (see section 3.4) for a card that has become worn or damaged during the tournament."
    },
    {
      "number": "3.4",
      "title": "Proxy Cards",
      "content": "A proxy card is used during competition to represent an otherwise legal Magic card or substitute card that can no longer be included in a deck without the deck being marked. For a proxy to be issued, the card it is replacing must meet at least one of the following criteria:\n\n• The card has been accidentally damaged or excessively worn in the current tournament, including damaged or misprinted Limited product. Proxies are not allowed as substitutes for cards that their owner has damaged intentionally or through negligence.\n• The card is a foil card for which no non-foil printing exists.\n\nPlayers may not create their own proxies; they may only be created by the Head Judge who has sole discretion as to whether the creation of a proxy is appropriate. When a judge creates a proxy, it is included in the player’s deck and must be denoted as a proxy in a clear and conspicuous manner. The original card is kept nearby during the match and replaces the proxy while in a public zone as long as it is recognizable. A proxy is valid only for the duration of the tournament in which it was originally issued."
    },
    {
      "number": "3.5",
      "title": "Substitute Cards",
      "content": "Official substitute cards are used to represent double-faced cards in the sets that contain them. Only official substitute cards may be used to represent double-faced cards in a deck. The name of the card that the substitute card is representing must be legible. Other modifications must follow the rules for modifying normal Magic cards.\n\nThe use of substitute cards is required if a player has double-faced cards in their deck and is not using completely opaque sleeves.\n\nIf a player uses a substitute card to represent a double-faced card in their deck, then all copies of that double-faced card in the deck must be represented by substitute cards, and any copies of that double-faced card in a hidden zone are considered to not exist for purposes of determining deck legality.\n\nA substitute card is only used while the card it represents is in a hidden zone. The card represented by a substitute card is not a playable Magic card until the substitute card has been placed in a public zone. Multiple substitute cards cannot be used to represent a single copy of the actual card. For each substitute card used, the player must have a copy of the actual card available, though they are not considered sideboard cards and are not presented to their opponent. Some older substitute cards contain a list of a set of cards that they may represent. These are sometimes referred to as “checklist cards” and can be used to represent any card listed on them. Each individual checklist card used must have one (and only one) of the items checked."
    },
    {
      "number": "3.6",
      "title": "Card Identification and Interpretation",
      "content": "A card is considered named in game when a player has provided a description (which may include the name or\npartial name) that could only apply to one card. Any player or judge realizing a description is still ambiguous\nmust seek further clarification.\nPlayers have the right to request access to the official wording of a card they can describe. That request will be\nhonored if logistically possible. The official text of any card is the Oracle text corresponding to the name of the\ncard. Players may not use errors or omissions in Oracle to abuse the rules. The Head Judge is the final authority for card interpretations, and they may overrule Oracle if an error is discovered.\n\nSome cards with a Universes Beyond treatment have different names for the Universes Beyond and Universes Within versions. These cards are considered to be the same card. Other special treatments of cards may alter the name in ways that are clear references to the original card (e.g. Swords2Plowshares); these are also considered to be the same card.\n\nSome nontraditional cards (i.e., attractions) may share a name across multiple versions of the card. The name is considered to refer to all versions and does not need further disambiguation, including during deck registration."
    },
    {
      "number": "3.7",
      "title": "New Releases",
      "content": "Newly released card sets become tournament legal for sanctioned, rated tournaments on the following dates:\n\n• Magic:The Gathering | Avatar: The Last Airbender™ November 14, 2025\n• Lorwyn Eclipsed™ January 16, 2026\n\nFor official Prerelease tournaments only, new sets are legal for use before the official format legal date. In these cases, any announced rules updates shall be in effect at these tournaments, including informal explanations of new rules and mechanics. Judges may apply additional rules that they believe will be updated. These dates may be subject to change. Any changes will be announced at http://www.magicthegathering.com."
    },
    {
      "number": "3.8",
      "title": "Game Markers",
      "content": "Small items (e.g., glass beads) may be used as markers and placed on top of a player’s own library or graveyard as a reminder for in-game effects. These markers may not disguise the number of cards remaining in that zone nor completely obscure any card."
    },
    {
      "number": "3.9",
      "title": "Die Rolling",
      "content": "Some game actions use a die roll to determine their outcome. Any method may be used to simulate this as long as all results have an equal chance of occurring. For example, using a 20-sided die to simulate a 6-sided die by dividing by 3 and rounding up (rerolling on 19 or 20) is acceptable. Dice with similar numbers clumped together (such as a spindown life tracker) may not be used for these actions.\n\nDice must have clear and easy to read values, and not be so large as to be disruptive when rolled. They must be\nrolled from a discernable height. Dice that leave the playing surface after landing, become mixed with similar\ndice, or do not land flat are ignored and rerolled.\nPlayers are expected to be clear about why they are rolling a die. A player who wishes to respond to a die roll is\nexpected to prevent the rolling player from taking action, but the rolling player cannot rush through to preempt\nresponses. A die roll is complete once the result is visible to the opponent.\n\nSome actions may require multiple dice to be rolled. If additional rolls would have no impact on the game, the player skips them. If a player rolls too many dice at once, all those dice are ignored and the correct number of dice are rolled."
    },
    {
      "number": "3.10",
      "title": "Card Shuffling",
      "content": "Decks must be randomized at the start of every game and whenever an instruction requires it. Randomization is defined as bringing the deck to a state where no player can have any information regarding the order or position of cards in any portion of the deck. Pile shuffling may not be performed other than once each at the beginning of a game to count the cards in the deck.\n\nOnce the deck is randomized, it must be presented to an opponent. By this action, players state that their decks are legal and randomized. The opponent may then shuffle it additionally. Cards and sleeves must not be in danger of being damaged during this process. If the opponent does not believe the player made a reasonable effort to randomize their deck, the opponent must notify a judge. Players may request to have a judge shuffle their cards rather than the opponent; this request will be honored only at a judge’s discretion.\n\nIf a player has had the opportunity to see any of the card faces of the deck being shuffled, the deck is no longer considered randomized and must be randomized again. At Competitive and Professional Rules Enforcement Level tournaments, players are required to shuffle their opponents’ decks after their owners have shuffled them. The Head Judge can require this at Regular Rules Enforcement Level tournaments as well."
    },
    {
      "number": "3.11",
      "title": "Sleeves",
      "content": "Players may use plastic card sleeves or other protective devices on cards. If a player chooses to use card sleeves, all sleeves must be identical and all cards in their deck must be placed in the sleeves in an identical manner. If the sleeves feature holograms or other similar markings, cards must be inserted into the sleeves so these markings appear only on the faces of the cards.\n\nDuring a match, a player may request that a judge inspect an opponent’s card sleeves. The judge may disallow the card sleeves if they believe they are marked, worn, or otherwise in a condition or of a design that interferes with shuffling or game play. In the interest of efficiency, the judge may choose to delay any change of sleeves until the end of the match. Competitive and Professional Rules Enforcement Level tournaments impose additional restrictions on sleeves. Highly reflective backs are not allowed. Sleeves with hologram patterns across some or all of the sleeve front or back are not allowed. Sleeves with artwork on their backs may be subjected to additional scrutiny, especially if there is no solid border around the edges.\n\nWhen using sleeves on double-faced cards, sleeves must be completely opaque.\n\nThe Head Judge is the final authority on what sleeves are allowed."
    },
    {
      "number": "3.12",
      "title": "Marked Cards",
      "content": "Players are responsible for ensuring that their cards and/or card sleeves are not marked during the tournament. A card or sleeve is considered marked if it bears something that makes it possible to identify the card without seeing its face, including (but not limited to) scratches, discoloration, and bends.\n\nIf a player’s cards are sleeved, the cards must be examined while in the sleeves to determine if they are marked. Players should use care when sleeving their decks and should randomize their decks prior to sleeving them to reduce the possibility of cards becoming marked with a pattern. Players should also keep in mind that cards or sleeves may become worn and potentially marked through play during a tournament.\n\nThe Head Judge has the authority to determine if a card in a player’s deck is marked. Judges may request that a player remove their current sleeves or replace any of the deck’s current sleeves immediately, or before the next round."
    },
    {
      "number": "3.13",
      "title": "Hidden Information",
      "content": "Hidden information refers to the faces of cards and other objects at which the rules of the game and format do not allow you to look.\n\nThroughout the match, a draft, and pregame procedures, players are responsible for keeping their cards above the level of the playing surface and for making reasonable efforts to prevent hidden information from being revealed. However, players may choose to share the contents of their hands, or any other hidden information available to them, to any other players unless specifically prohibited by the rules. Players must not actively attempt to gain information hidden from them but are not required to inform opponents who are accidentally revealing hidden information."
    },
    {
      "number": "3.14",
      "title": "Tapped/Flipped Cards",
      "content": "If a card must be tapped or flipped, it must be turned approximately 90 degrees (tapped) or 180 degrees (flipped), whichever is appropriate."
    },
    {
      "number": "3.15",
      "title": "Graveyard Order",
      "content": "In formats involving only cards from Urza’s Saga™ and later, players may change the order of their graveyard at any time. A player may not change the order of an opponent’s graveyard."
    },
    {
      "number": "3.16",
      "title": "Sideboard",
      "content": "A sideboard is a group of additional cards the player may use to modify their deck between games of a match. The player may use these cards in their main deck during all games after the first one in a match.\n\nBefore each game begins, players must present their sideboard (if any) face down. Opponents may count the number of cards in their opponent’s sideboard at any time. Players are not required to reveal how many cards they have swapped from their main deck to their sideboard and do not have to swap one for one. Other items (token cards, double-faced card represented in the deck by a substitute card, etc.) should be kept separate from the sideboard during game play.\n\nDuring a game, players may look at their own sideboard, keeping it clearly distinguishable from other cards at all\ntimes. If a player gains control of another player, they may not look at that player’s sideboard, nor may they have that player access their sideboard.\n\nThe deck and sideboard must each be returned to their original compositions before the first game of each match. Restrictions on the composition and use of a sideboard can be found in the deck construction rules for a particular format type.\n\nIf a penalty causes a player to lose the first game in a match before that game has begun, or the first game is intentionally drawn before any cards are played, neither player may use cards from their sideboard for the next game in the match. If players restart a game due to an in-game effect, the composition of their decks must remain the same for the restarted game.\n\nCertain cards refer to “a (card or cards) from outside the game.” In tournament play, these are cards in that player’s sideboard."
    }
  ]
}