{
  "section_number": 10,
  "title": "10. Sanctioning Rules",
  "section_key": "mtr_section_10",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "10.1",
      "title": "Participation Minimums",
      "content": "Participation minimums for a tournament to be sanctioned as a rated tournament are as follows:\n\n• For individual tournaments, a minimum of four (4) players must participate.\n• For team and Two-Headed Giant tournaments, a minimum of four (4) teams must participate.\n\nCertain Premier tournaments (e.g, Regional Championship Qualifiers) require a higher minimum number of\nplayers.\n\nIf the participation minimum is not met, the tournament is no longer DCI-sanctioned. If participation minimums are not met for any DCI-sanctioned tournament, the Tournament Organizer should report the tournament as “Did Not Occur.”"
    },
    {
      "number": "10.2",
      "title": "Number of Rounds",
      "content": "The minimum number of rounds required for a tournament to be sanctioned as a rated tournament is as follows:\n\n• For individual tournaments, a minimum of three (3) rounds\n• For team and Two-Headed Giant tournaments, a minimum of two (2) rounds\n\nIf the minimum number of rounds is not met, the tournament is no longer DCI-sanctioned. If the minimum\nnumber of rounds is not met for any DCI-sanctioned, rated tournament, the Tournament Organizer should report\nthe tournament as “Did Not Occur.”\nThe number of rounds should be announced at or before the beginning of the first round; once announced, it\ncannot be changed. A variable number of rounds can be announced instead, with specific criteria for ending the\ntournament. For example, a tournament with 20 players can be announced as five rounds unless only one player has four match wins after four rounds.\n\nThe recommended number of rounds for Swiss tournaments can be found in Appendix E."
    },
    {
      "number": "10.3",
      "title": "Invitation-Only Tournaments",
      "content": "Invitation-only tournaments have additional qualification criteria for player participation. The invitation list for Premier tournaments is defined in the Magic: The Gathering Premier Tournament Invitation Policy. Tournament Organizers may hold and sanction invitation-only non-Premier tournaments, as long as they are sanctioned as a Magic Premier Series."
    },
    {
      "number": "10.4",
      "title": "Pairing Algorithm",
      "content": "Unless otherwise announced, tournaments are assumed to follow the Swiss pairing algorithm. Some tournaments may proceed to single-elimination playoff rounds between the top 2, 4, or 8 (or other number) players after the Swiss rounds are over. The Swiss pairing algorithm is modified in booster draft tournaments as explained in section 7.6. At Pro Tour, Limited Championship, and World Championship tournaments, competitors are advanced to the playoff rounds before the end of the Swiss rounds (and receive byes for the remaining Swiss rounds) if they have achieved the announced number of match points required to advance to the playoff rounds. In this case, competitors in the Top 8 playoff are seeded in order from 1st through 8th. Seeding is determined by:\n\n• The round in which a competitor received the required number of match points to advance to the playoff rounds.\n• Their opponents’ match-win percentage, the competitor’s game-win percentage, and their opponents’ game-win percentage as of the round in which they receive the required number of match points to advance to the playoff rounds.\n• Seeding for the Top 8 playoff is locked after each round in which a competitor receives the required number of match points to advance to the playoff rounds. For constructed tournaments that have a single-elimination playoff (or Sealed Deck tournaments that do not use a Booster Draft for the playoff), the recommended pairing method is to pair the playoff players by the final Swiss standings.\n\nFor an 8-player playoff, the 1st place player plays the 8th place player, the 2nd place player plays the 7th place player, the 3rd place player plays the 6th place player, and the 4th place player plays the 5th place player. The winners of the 1st/8th place and 4th/5th place matches play each other in the next round of the playoff. The winners of the 2nd/7th place and 3rd/6th place matches play each other in the next round of the playoff. The remaining players play in the last round of the playoff.\n\nFor a 4-player playoff, the 1st place player plays the 4th place player, and the 2nd place player plays the 3rd place\nplayer. The remaining players play in the last round of the playoff.\n\nFor Limited tournaments that have a single-elimination Booster Draft playoff, it is recommend that only an 8- player playoff is run using the following method described below.\n\nUse a random method to seat players around the draft table and conduct the draft.\n\nAfter the draft has concluded, the player in seat 1 plays the player in seat 5, the player in seat 2 plays the player in seat 6, the player in seat 3 plays the player in seat 7, and the player in seat 4 plays the player in seat 8. The winners of the seat 1/5 and the 3/7 matches play each other in the next round of the playoff. The winners of the seat 2/6 and the seat 4/8 matches play each other in the next round of the playoff. The remaining players play in the last round of the playoff.\n\nFor most Premier Events, the playoff options above are required, not optional. Premier Events include the following tournaments: Magic: The Gathering World Championship, Pro Tour, Limited Championship, Pro Tour Qualifier, Spotlight Series, Regional Championship, and Regional Championship Qualifier"
    }
  ]
}