{
  "section_number": 4,
  "title": "4. Communication",
  "section_key": "mtr_section_4",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "4.1",
      "title": "Player Communication",
      "content": "Communication between players is essential to the successful play of any game that involves virtual objects or hidden information. While bluffing may be an aspect of games, there need to be clear lines as to what is, and is not, acceptable for players to say or otherwise represent. This will confirm expectations of both sporting and competitive players during a game.\n\nA player should have an advantage due to better understanding of the options provided by the rules of the game, greater awareness of the interactions in the current game state, and superior tactical planning. Players are under no obligation to assist their opponents in playing the game. Regardless of anything else, players are expected to treat opponents politely and with respect. Failure to do so may lead to Unsporting Conduct penalties.\n\nThere are four categories of information: status, free, derived, and private.\nStatus information is information that must be announced upon change and physically tracked by the affected\nplayer. Methods for tracking must be visible to both players during the match. A shared method is acceptable as long as all players in the match have access to it. At Competitive and Professional REL, methods that can easily be accidentally changed (such as dice) may not be used. Status information consists of:\n\n• Life total.\n• Counters a player has attached to them.\n• Continuous effects with no defined expiration within the game that apply to that player, such as Monarch or City’s Blessing.\n• Unspent mana in a player’s mana pool.\n• Location in a dungeon.\n• How many times the Ring has tempted a player.\n• Current speed.\n\nFree information is information to which all players are entitled access without contamination or omissions made by their opponents. If a player is ever unable or unwilling to provide free information to an opponent that has requested it, they should call a judge and explain the situation. Free information consists of:\n\n• Details of current game actions and past game actions that still affect the game state.\n• The name of any visible object.\n• The number and type of any counter that isn’t defined as status information.\n• The state (whether it’s tapped, attached to another permanent, face down, etc.) and current zone of any object or player.\n• The game score of the current match.\n• The current step and/or phase and which player(s) are active.\n\nDerived information is information to which all players are entitled access, but opponents are not obliged to assist in determining and may require some skill or calculation to determine. Derived information consists of:\n\n• The number of any kind of objects present in any game zone that are not defined as free information.\n• All characteristics of objects in public zones that are not defined as free or status information.\n• Game Rules, Tournament Policy, Oracle content and any other official information pertaining to the current tournament. Cards are considered to have their Oracle text printed on them.\n\nPrivate information is information to which players have access only if they are able to determine it from the\ncurrent visual game state or their own record of previous game actions.\n• Any information that is not status, free or derived is automatically private information.\n\nThe following rules govern player communication:\n\n• Players must announce any changes to status information about themselves and must represent it with a physical designation.\n• If a player notices a discrepancy in recorded or announced status information, they are expected to point it out as soon as the discrepancy is noticed.\n• Players must answer all questions asked of them by a judge completely and honestly, regardless of the type of information requested. Players may request to do so away from the match.\n• Players may not represent derived, free, or status information incorrectly.\n• Players must answer completely and honestly any specific questions pertaining to free information.\n• At Regular Rules Enforcement Level, all derived information is instead considered free.\n\nJudges are encouraged to help players in determining free and status information but must avoid assisting players with derived information about the game state."
    },
    {
      "number": "4.2",
      "title": "Tournament Shortcuts",
      "content": "A tournament shortcut is an action taken by players to skip parts of the technical play sequence without explicitly announcing them. Tournament shortcuts are essential for the smooth play of a game, as they allow players to play in a clear fashion without getting bogged down in the minutiae of the rules. Most tournament shortcuts involve skipping one or more priority passes to the mutual understanding of all players; if a player wishes to demonstrate or use a new tournament shortcut entailing any number of priority passes, they must be clear where the game state will end up as part of the request.\n\nA player may interrupt a tournament shortcut by explaining how they are deviating from it or at which point in the middle they wish to take an action. A player may interrupt their own shortcut in this manner. If part of the shortcut is discovered to be or becomes illegal, the shortcut stops at that point. A player is not allowed to use a previously undeclared tournament shortcut, or to modify an in-use tournament shortcut without announcing the modification, in order to create ambiguity in the game. A player may not request priority and take no action with it. If a player decides they do not wish to do anything, the request is nullified and priority is returned to the player that originally had it.\n\nDuring the resolution of one of their spells or abilities, a player may not assume their opponent has taken a\nshortcut. They must seek confirmation that a choice with no visible impact was taken.\n\nCertain conventional tournament shortcuts used in Magic are detailed below. They define a default communication; if a player wishes to deviate from these, they should be explicit about doing so. Note that some of these are exceptions to the policy above in that they do cause non-explicit priority passes.\n\n• If the active player passes priority with an empty stack during their first main phase, the non-active player is assumed to be acting in beginning of combat unless they are affecting whether a beginning of combat ability triggers. Then, after those actions resolve or no actions took place, the active player receives priority at the beginning of combat. Beginning of combat triggered abilities (even ones that target) may be announced at this time.\n• If the active player passes priority with an empty stack during their second main phase or uses a phrase such as “Go” or “Your Turn” at any time, the non-active player is assumed to be acting in the end step unless they are affecting how or whether an end of turn ability triggers. End of turn triggered abilities that do not target resolve after the non-active player passes priority.\n• Whenever a player adds an object to the stack, they are assumed to be passing priority unless they explicitly announce that they intend to retain it.\n• If a player adds a group of objects to the stack without explicitly retaining priority, they are assumed to be adding them to the stack individually and allowing each to resolve before adding the next. If another player wishes to take an action at a point in the middle of this sequence, the actions should be reversed to that point.\n• If a player casts a spell or activates an ability and announces choices for it that are not normally made until resolution, the player must adhere to those choices unless an opponent responds to that spell or\nability. If an opponent inquires about choices made during resolution, that player is assumed to be passing priority and allowing that spell or ability to resolve.\n• A player is assumed to have paid any cost of 0 unless they announce otherwise.\n• A player who casts a spell or activates an ability that targets an object on the stack is assumed to target the legal spell closest to the top of the stack unless the player specifies otherwise.\n• A player is assumed to be attacking another player with their creatures and not any planeswalkers that player may control.\n• If an object has multiple mana abilities, a player is assumed to be activating the one that most specifically applies to the spell or ability for which that mana is being used, unless they announce otherwise.\n• A player who does not scry/surveil when instructed to is assumed to have not looked and chosen to leave the cards in the same order.\n• In the Two-Headed Giant format, attacking creatures are assumed to be attacking the head of the defending player sitting directly across from their controller, unless the creature's controller specifies otherwise."
    },
    {
      "number": "4.3",
      "title": "Out-of-Order Sequencing",
      "content": "Due to the complexity of accurately representing a game of Magic, it is acceptable for players to engage in a block of actions that, while technically in an incorrect order, arrive at a legal and clearly understood game state once they are complete.\n\nAll actions taken must be legal if they were executed in the correct order, and any opponent can ask the player to do the actions in the correct sequence so that they can respond at the appropriate time (at which point players will not be held to any still-pending actions). An out-of-order sequence must not result in a player prematurely gaining information which could reasonably affect decisions made later in that sequence.\n\nPlayers may not try to use opponent's reactions to some portion of an out-of-order sequence to see if they should modify actions or try to take additional ones. Nor may players use out-of-order sequencing to try to retroactively take an action they missed at the appropriate time. In general, any substantial pause at the end of a completed batch is an indication that all actions have been taken, the sequence is complete and the game has moved to the appropriate point at the end of the sequence.\n\nExamples\n1. A player discards a card to pay for Masticore’s upkeep cost before untapping their land.\n2. A player resolves Harrow and puts the card into their graveyard, then searches.\n3. While resolving Restore Balance, a player discards before sacrificing lands and creatures.\n4. A player with two creatures being put into the graveyard due to state-based actions resolves the leaves-the-battlefield triggered ability on one of them before putting the other creature in the graveyard.\n5. A player declares a blocker, animates a Treetop Village, and then attempts to block with that Treetop Village."
    },
    {
      "number": "4.4",
      "title": "Loops",
      "content": "A loop is a form of tournament shortcut that involves detailing a sequence of actions to be repeated and then performing a number of iterations of that sequence. The loop actions must be identical in each iteration and cannot include conditional actions (\"If this, then that\".) If no players are involved in maintaining the loop, each player in turn order chooses a number of iterations to perform before they will take an action to break the loop or that they wish to take no action. If all players choose to take no action, the game is a draw. Otherwise, the game advances through the lowest number of iterations chosen and the player who chose that number takes an action to break the loop.\n\nIf one player is involved in maintaining the loop, they choose a number of iterations. The other players, in turn order, agree to that number or announce a lower number after which they intend to intervene. The game advances through the lowest number of iterations chosen and the player who chose that number receives priority.\n\nIf two or more players are involved in maintaining a loop within a turn, each player in turn order chooses a\nnumber of iterations to perform. The game advances through the lowest number of iterations chosen and the\nplayer who chose that number receives priority.\nLoops may span multiple turns if a game state is not meaningfully changing. Note that drawing cards other than\nthe ones being used to sustain the loop is a meaningful change. If two or more players are involved in maintaining\na loop across turns, each player chooses a number of iterations to perform, or announces their intent to continue\nindefinitely. If all players choose to continue indefinitely, the game is a draw. Otherwise, the game advances through the lowest number of iterations chosen and the player who chose that number receives priority at the point they stop taking an action to sustain the loop.\n\nA player intervening during a loop may specify that one iteration of the loop is only partly performed in order to\nbe able to take action at the appropriate point. If they do, the final iteration is only performed up to the chosen\npoint.\n\nNon-deterministic loops (loops that rely on decision trees, probability, or mathematical convergence) may not be\nshortcut. A player attempting to execute a nondeterministic loop must stop if at any point during the process a previous game state (or one identical in all relevant ways) is reached again. This happens most often in loops that involve shuffling a library. Some loops are sustained by choices rather than actions. In these cases, the rules above may be applied, with the player making a different choice rather than ceasing to take an action. The game moves to the point where the player makes that choice. If the choice involves hidden information, a judge may be needed to determine whether any choice is available that will not continue the loop.\n\nThe judge is the final arbiter of what constitutes a loop. A player may not 'opt-out' of shortcutting a loop, nor may they make irrelevant changes between iterations in an attempt to make it appear as though there is no loop. Once a loop has been shortcut, it may not be restarted until the game has changed in a relevant way. Proposing loops as an effort to use up time on the clock is Stalling."
    },
    {
      "number": "4.5",
      "title": "Triggered Abilities",
      "content": "Players are expected to remember their own triggered abilities; intentionally ignoring one is Cheating. Players are\nnot required to point out the existence of triggered abilities that they do not control, though they may do so if they\nwish.\n\nTriggered abilities are considered to be forgotten by their controller once they have taken an action past the point where the triggered ability would have an observable impact on the game. Triggered abilities that are forgotten are not considered to have gone onto the stack. How forgotten triggered abilities are subsequently handled is defined by the Rules Enforcement Level of the tournament."
    },
    {
      "number": "4.6",
      "title": "Team/Two-Headed Giant Communication",
      "content": "Members of the same team may communicate between one another except during times where explicitly prohibited by the team format rules. However, team members that have an opportunity to acquire hidden information (e.g., by speaking to spectators following their own match while a teammate is still playing), are restricted from communicating with teammates for the duration of that match.\n\nProhibitions against written notes of any kind during drafts apply to team drafts as well."
    },
    {
      "number": "4.7",
      "title": "Game Layout",
      "content": "Players in Competitive and Professional Rules Enforcement Level matches must arrange their cards, tokens, and other accessories on the battlefield using the following layout:\n\n• From the player’s perspective, nonlands must be kept closer to the player’s opponent than lands, and no non-land cards should be between the land area and the edge of the table closest to the player.\n• Non-creature permanents whose use may reasonably be associated with either the land or nonland area (e.g., an artifact whose only ability is a mana ability) may be located in either area, provided the overall layout is, in the judgment of tournament officials, clear. However, permanents that are also creatures (e.g., artifacts with March of the Machines on the battlefield, Dryad Arbor, or a Treetop Village that is currently a creature) must be placed in the nonland area. Players may not use other cards to intentionally obscure the presence of a permanent in any area of the battlefield.\n• Each card should remain clearly associated with any permanents attached to it. For example, an Aura enchanting a land should be in the land area in contact with that land.\n• The player’s library, graveyard, and exiled cards should be kept all to the left of the battlefield or all to the right of the battlefield at the player’s discretion.\n• The player’s graveyard and exiled cards should be adjacent to the player’s library. All three should be distinct at all times.\n• If a card is exiled by a permanent and that permanent includes a way to perform additional actions with the exiled card, the association of the two cards must be clear. Keeping the two cards together is recommended.\n• Each untapped permanent should face its controller. Players are permitted to briefly turn a card upside-down as a memory aid.\n\nPhysical objects used to represent permanents must have a way of clearly representing any in-game status, such as whether a permanent is tapped. Sleeves or card backs that appear similar to any player’s sleeves or card backs may not be used. The Head Judge is the final authority on what may be used to represent permanents. Tournament officials may make exceptions or additions to these guidelines at their sole discretion in order to keep each player’s game layout clear. Players in exceptional situations (e.g., a player playing a deck with no lands or a deck that makes significant use of the graveyard) should consult with tournament officials to determine what allowances, if any, will be made."
    },
    {
      "number": "4.8",
      "title": "Reversing Decisions",
      "content": "Players are expected to consider their options before taking an action and players are not usually allowed to take back an action that has been communicated to their opponent, either verbally or physically.\n\nSometimes, a player will realize that they have made a wrong decision after making a play. If that player has not gained any information since taking the action and they wish to make a different decision, a judge may allow that player to change their mind. Judges must carefully consider whether the player has gained information since making the play that might have affected the decision; in particular, players may not try to use opponent reactions (or lack thereof) to see if they should modify actions they committed to. If the judge cannot be sure no information was gained, they should not allow the decision to be changed. Teammates intervening before information has been gained is acceptable when considering a backup.\n\nExamples\n\n1. A player plays an Island and, before anything else happens, says “Sorry, I meant to play a Swamp.”\n2. A player says “No blocks” immediately followed by “Wait, no, I block with this creature.”\n3. A player says “Go. Wait, land, go.”"
    },
    {
      "number": "4.9",
      "title": "Day/Night",
      "content": "Day/Night is a state that can change over the course of the game, but is not controlled by either player. Once created, it continues to be tracked, even if there are no objects in the game that care about the current state. It is the responsibility of both players to track the current state and point out when it is represented incorrectly by the shared method being used to track it.\n\nBecause responsibility for the state is shared, an erroneously-represented state should be handled as a Communication Policy Violation, but neither player receives the Warning. If the players and judges are unable to determine the current status, the judge should assume it is Night, as a turn with no spells played is more likely to be forgotten than a turn with multiple spells played."
    }
  ]
}