{
  "section_number": "B",
  "title": "Appendix B—Time Limits",
  "section_key": "mtr_appendix_b",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "B",
      "title": "Time Limits",
      "content": "Appendix B—Time Limits\n\nThe required minimum time limit for any match is 40 minutes. The following time limits are recommended for each round of a tournament:\n\n• Constructed and Limited tournaments—50 minutes\n• Single-elimination quarterfinal or semifinal matches—90 minutes\n• Single-elimination final matches—no time limit\n\nThe following additional time limits are recommended for Limited tournaments:\n\n• Sealed Deck—20 minutes for deck registration and 30 minutes for deck construction. For Prereleases and Sealed Deck events that take place on the weekend of a new set release, 15 additional minutes for deck construction is recommended.\n• Draft—25 minutes for deck registration and construction.\n• Team Sealed Deck—20 minutes for deck registration and 60 minutes for deck construction. For Team-format Sealed Deck events that take place on the weekend of a new set release, 15 additional minutes for deck construction is recommended.\n• Team Draft—40 minutes for deck construction and registration.\n• Two-Headed Giant Sealed Deck—20 minutes for deck registration and 60 minutes for deck\nconstruction. For Two-headed Giant Sealed Deck events that take place on the weekend of a new set release, 15 additional minutes for deck construction is recommended.\n• Two-Headed Giant Draft—40 minutes for deck construction and registration The Head Judge of the tournament is the final authority on time limits for a tournament. However, any deviation from these recommendations must be announced prior to and during tournament registration.\n\nMagic Premier Tournaments may have different time limits. These time limits can be found in the tournament or tournament series fact sheet.\n\nIn timed rounds, players must wait for the officially tracked time to begin before starting their match.\n\nBooster Draft Timing Individual Booster Drafts have the following default time limits for each pick:\n\nCards remaining in pack Time allotted 15 cards 40 seconds\n\n14 cards 40 seconds\n\n13 cards 35 seconds 12 cards 30 seconds\n\n11 cards 25 seconds\n\n10 cards 25 seconds\n\n9 cards 20 seconds 8 cards 20 seconds\n\n7 cards 15 seconds\n\n6 cards 10 seconds 5 cards 10 seconds\n\n4 cards 5 seconds\n\n3 cards 5 seconds 2 cards 5 seconds\n\n1 card N/A\n\nThe time for review after the first booster pack is 60 seconds. Each subsequent review period increases by 30\nseconds.\n\nRochester Draft Timing\n\nThe review period for a booster after it has been laid out on the table and before the first card is drafted is 20\nseconds. Players have 5 seconds for each pick.\n\nTwo-Headed Giant Draft Timing Two-Headed Giant Booster Drafts have the following default time limits for each pick:\n\nCards remaining in pack 15-Card Booster 14-Card Booster Time allotted\n\n15 14 50 seconds\n\n13 12 45 seconds 11 10 40 seconds\n\n9 8 30 seconds\n\n7 6 20 seconds\n\n5 4 10 seconds 3 - 5 seconds\n\n1 2 N/A\n\nIn addition, players receive 60 seconds to review their drafted cards in between booster packs."
    }
  ]
}