{
  "section_number": 8,
  "title": "8. Team Tournament Rules",
  "section_key": "mtr_section_8",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "8.1",
      "title": "Team Names",
      "content": "Wizards of the Coast reserves the right to disallow any team name it deems offensive and/or obscene. Tournament \nofficials may disallow teams from registering team names that may be considered offensive and/or obscene."
    },
    {
      "number": "8.2",
      "title": "Team Composition and Identification",
      "content": "A valid team consists of two or three members, as appropriate to the format. A team is identified by the individual \nregistration information (Wizards Account) of its respective members and all teams must provide the Tournament \nOrganizer with the full information when registering for the tournament. Individuals may be members of more \nthan one team, though not during the same tournament. If a player drops from the tournament, the entire team is \ndropped from the tournament. If a player is disqualified from the tournament, the entire team is disqualified from \nthe tournament. \nTeams must designate player positions during tournament registration. For example, in a three-player team \ntournament, each team must designate who is player A, player B, and player C. Players retain these designations \nthroughout the entire tournament. \nWhen two teams are paired against each other during the course of a tournament, the team members designated as \n“player A” play against each other, the team members designated as “player B” play against each other, and so on."
    },
    {
      "number": "8.3",
      "title": "Team Communication Rules",
      "content": "The rules for team communication are the same as those for Two-Headed Giant. See section 4.6 for more details."
    },
    {
      "number": "8.4",
      "title": "Unified Deck Construction Rules",
      "content": "Team Constructed tournaments use Unified Deck Construction rules: Except for cards with the basic supertype, \nno two decks on a team may contain the same card, based on its English card title. (For example, if one player is \nusing Naturalize in a Team Constructed tournament, no other player on that team may use Naturalize in their \ndeck.) No players may use cards that are banned in a particular format. Cards that override deck construction rules \n(i.e., Relentless Rats) may only override them for one deck on a team. \nUnified Deck Construction rules are only applied when all members of a team have decks of the same format."
    },
    {
      "number": "8.5",
      "title": "Team Rochester Draft Tournaments",
      "content": "Team Rochester Draft tournaments require teams of three players each. Two teams are seated at each table for the \ndraft. Team members sit clockwise in A-B-C order around the table. (For example, in a three-person team \ntournament, players sit around the table clockwise in this order: 1A, 1B, 1C, 2A, 2B, 2C.) \nA team determined at random chooses either to pick first or to allow the other team to pick first. Player B of the \nteam that picks first lays out the first pack. \nThe draft begins with the first player opening their first booster and laying out the entire contents of the pack face \nup on the table as directed by tournament officials, with the cards facing them. After reviewing the cards, drafting \nproceeds with each player selecting a single card in turn. Once a player has selected a card and placed it with their \nother drafted cards, they may not select a different card. If a player fails to select a card in the time given, a \ntournament official selects for that player the “oldest” card remaining from the booster pack (the card on the table \nthe longest). \n\nThe player drafting first from the cards presented on the table is called the active player. The first active player is \nthe participant who opened the first booster pack of the draft, as designated by a tournament official. All players \nin each drafting pod serve as the active player once for each group of booster packs. The identity of the active \nplayer moves in a horseshoe pattern, clockwise for the first and third booster packs and counterclockwise for the \nsecond. The player who was last to open a booster pack from a group is the first to open the booster pack from the \nnext group. \nThe draft order also begins moving in a horseshoe pattern, clockwise for the first and third boosters and \ncounterclockwise for the second, beginning with the active player, continuing around the table to the last player in \nthe group to draft a card. The last player in the group selects two cards sequentially, and then drafting continues in \nreverse order, moving back to the player who began the drafting. If there are still cards remaining, the player who \nbegan the drafting selects two cards, and drafting continues again in the opposite direction. \nExample: Team 1 and Team 2 are seated around a table. They are numbered 1A-1B-1C-2A-2B-2C in a clockwise \norder. Team 2 wins the coin toss, and the members of Team 2 choose to let Team 1 pick first. The active player \nfor the first pack is Player 1B. The first booster pack for Player 1B is opened and placed face up in front of Player \n1B. After the 20-second review period has expired, the draft order is as follows: \nPlayer 1B— card 1 Player 1A—card 6 Player 1C— card 11 \nPlayer 1C— card 2 Player 1A—card 7 Player 1B— card 12 \nPlayer 2A—card 3 Player 2C— card 8 Player 1B— card 13 \nPlayer 2B— card 4 Player 2B— card 9 Player 1C— card 14 \nPlayer 2C— card 5 Player 2A—card 10 Player 2A—card 15 \nDuring card selection, players must display the most recent card they drafted from the current pack. At all other \ntimes, players may leave one of their drafted cards face up on their draft pile or may leave all cards face down. \nPlayers may not review their draft picks while drafting proceeds or at any other time specifically indicated by \ntournament officials."
    },
    {
      "number": "8.6",
      "title": "Team Sealed Deck Tournaments",
      "content": "All the rules for individual Limited tournaments (Section 7) apply to Team Sealed Deck tournaments except as \nfollows. \nEach team must receive the same product mix. For example, if one team receives twelve Murders at Karlov \nManor play boosters, every team must receive twelve Murders at Karlov Manor play boosters. \nEight boosters per team are recommended for two-person team tournaments, and twelve boosters per team for \nthree-person team tournaments. For the recommended product mix for the current block, refer to Appendix D. \nAll cards must be assigned to a player’s deck or sideboard during deck construction and cannot be transferred to \nanother player during that tournament. (Players do not share main deck or sideboard cards.) Players may exchange \ncards in their pool in Regular Rules Enforcement Level tournaments that do not use decklists, but only between \nrounds. \n\n9. Two-Headed Giant Tournament Rules \n9.1 Match Structure \nTwo-Headed Giant matches consist of one game. All players from the two teams play in the same game. \nDrawn games (games without a winner) do not count toward the one game. As long as match time allows, the \nmatch continues until a team has won a game. \n9.2 Communication Rules \nTeammates may communicate with each other at any time. \n9.3 Play-Draw Rule \nA team determined at random chooses either to play first or to play second. The choice must be made before \neither player on that team looks at their hand. If either player on that team looks at their hand before their choice \nis made, that team plays first. The team who plays first skips the draw step of their first turn. \n9.4 Pregame Procedure \n1. Players decide which teammate will be the primary player and which teammate will be the secondary \nplayer. Players should be seated with the primary player to the right of their teammate. Players can \nchoose a different primary and secondary player before each match. \n2. Players shuffle their decks. \n3. Players present their decks to their opponents for additional shuffling. \n4. The appropriate team must decide whether to play first or second at this point, if they have not done \nso already (see section 9.3) \n5. Each player draws seven cards. Optionally, these cards may be dealt face down on the table. \n6. Each player, in turn order, decides whether to mulligan. (Rules on Two-Headed Giant mulligans can \nbe found in the Magic Comprehensive Rules, rule 103.4c) \nOnce players have completed their mulligans, the game can begin. \n9.5 Two-Headed Giant Constructed Rules \nTwo-Headed Giant Constructed tournaments use Unified Deck Construction rules (see section 8.4). \nIn addition to cards banned in particular formats, the following card is banned in ALL Two-Headed Giant \nConstructed tournaments (Vintage, Legacy, Modern, and Block Constructed): \n• Erayo, Soratami Ascendant \nSideboards are not allowed in constructed Two-Headed Giant tournaments. \n9.6 Two-Headed Giant Limited Rules \nAll the rules for Limited Tournaments (Section 7) apply, except as described below. \nEight boosters per team are recommended for Two-Headed Giant Sealed Deck tournaments and six boosters per \nteam for Two-Headed Giant Booster Draft tournaments. For the recommended product mix for the current block, \nrefer to Appendix D. \n\nCards not used in a team’s starting decks are considered a shared sideboard by the two players that both players \ncan access. \n9.7 Two-Headed Giant Booster Draft Tournaments \nTeams (not players) assemble into random drafting circles (called pods) of roughly equal size at the direction of \nthe Head Judge. Teammates sit next to each other. Tournament officials then distribute identical boosters to each \nteam in the pod. \nAfter opening and counting the cards in their first pack, the team chooses two cards from the booster pack then \npasses the remaining cards face down to the team on its left. Selected cards may be placed into one or two piles. \nThe cards chosen are not assigned to a particular player; they become part of a pool out of which both players will \nconstruct their decks. The open packs are passed around the drafting pod—with each team taking two cards from \neach before passing— until all cards are drafted. \nFor the second pack, the direction of drafting is reversed as usual. Thus, the overall draft direction is left–right–\nleft–right–left–right. \n\n10. Sanctioning Rules \n10.1 Participation Minimums \nParticipation minimums for a tournament to be sanctioned as a rated tournament are as follows: \n• For individual tournaments, a minimum of four (4) players must participate. \n• For team and Two-Headed Giant tournaments, a minimum of four (4) teams must participate. \nCertain Premier tournaments (e.g, Regional Championship Qualifiers) require a higher minimum number of \nplayers. \nIf the participation minimum is not met, the tournament is no longer DCI-sanctioned. If participation minimums \nare not met for any DCI-sanctioned tournament, the Tournament Organizer should report the tournament as “Did \nNot Occur.” \n10.2 Number of Rounds \nThe minimum number of rounds required for a tournament to be sanctioned as a rated tournament is as follows: \n• For individual tournaments, a minimum of three (3) rounds \n• For team and Two-Headed Giant tournaments, a minimum of two (2) rounds \nIf the minimum number of rounds is not met, the tournament is no longer DCI-sanctioned. If the minimum \nnumber of rounds is not met for any DCI-sanctioned, rated tournament, the Tournament Organizer should report \nthe tournament as “Did Not Occur.” \nThe number of rounds should be announced at or before the beginning of the first round; once announced, it \ncannot be changed. A variable number of rounds can be announced instead, with specific criteria for ending the \ntournament. For example, a tournament with 20 players can be announced as five rounds unless only one player \nhas four match wins after four rounds. \nThe recommended number of rounds for Swiss tournaments can be found in Appendix E. \n10.3 Invitation-Only Tournaments \nInvitation-only tournaments have additional qualification criteria for player participation. The invitation list for \nPremier tournaments is defined in the Magic: The Gathering Premier Tournament Invitation Policy. Tournament \nOrganizers may hold and sanction invitation-only non-Premier tournaments, as long as they are sanctioned as a \nMagic Premier Series. \n10.4 Pairing Algorithm \nUnless otherwise announced, tournaments are assumed to follow the Swiss pairing algorithm. Some tournaments \nmay proceed to single-elimination playoff rounds between the top 2, 4, or 8 (or other number) players after the \nSwiss rounds are over. The Swiss pairing algorithm is modified in booster draft tournaments as explained in \nsection 7.6. \nAt Pro Tour, Limited Championship, and World Championship tournaments, competitors are advanced to the \nplayoff rounds before the end of the Swiss rounds (and receive byes for the remaining Swiss rounds) if they have \nachieved the announced number of match points required to advance to the playoff rounds. In this case, \ncompetitors in the Top 8 playoff are seeded in order from 1st through 8th. Seeding is determined by: \n\n• The round in which a competitor received the required number of match points to advance to the playoff \nrounds. \n• Their opponents’ match-win percentage, the competitor’s game-win percentage, and their opponents’ \ngame-win percentage as of the round in which they receive the required number of match points to \nadvance to the playoff rounds. \n• Seeding for the Top 8 playoff is locked after each round in which a competitor receives the required \nnumber of match points to advance to the playoff rounds. \nFor constructed tournaments that have a single-elimination playoff (or Sealed Deck tournaments that do not use a \nBooster Draft for the playoff), the recommended pairing method is to pair the playoff players by the final Swiss \nstandings. \nFor an 8-player playoff, the 1st place player plays the 8th place player, the 2nd place player plays the 7th place \nplayer, the 3rd place player plays the 6th place player, and the 4th place player plays the 5th place player. The \nwinners of the 1st/8th place and 4th/5th place matches play each other in the next round of the playoff. The winners \nof the 2nd/7th place and 3rd/6th place matches play each other in the next round of the playoff. The remaining \nplayers play in the last round of the playoff. \n \nFor a 4-player playoff, the 1st place player plays the 4th place player, and the 2nd place player plays the 3rd place \nplayer. The remaining players play in the last round of the playoff. \n \nFor Limited tournaments that have a single-elimination Booster Draft playoff, it is recommend that only an 8-\nplayer playoff is run using the following method described below. \nUse a random method to seat players around the draft table and conduct the draft. \n \n\nAfter the draft has concluded, the player in seat 1 plays the player in seat 5, the player in seat 2 plays the player in \nseat 6, the player in seat 3 plays the player in seat 7, and the player in seat 4 plays the player in seat 8. The \nwinners of the seat 1/5 and the 3/7 matches play each other in the next round of the playoff. The winners of the \nseat 2/6 and the seat 4/8 matches play each other in the next round of the playoff. The remaining players play in \nthe last round of the playoff. \n \nFor most Premier Events, the playoff options above are required, not optional. \nPremier Events include the following tournaments: Magic: The Gathering World Championship, Pro Tour, \nLimited Championship, Pro Tour Qualifier, Spotlight Series, Regional Championship, and Regional \nChampionship Qualifier \n\nAppendix A—Changes From Previous Versions \nOnly changes from the current version and the previous version of this document will be displayed in this \nappendix. \nNovember 10, 2025 \n3.7: New set added. \n6.3: Three (3) cards banned. New set added. \n6.4: New set added. \n6.6: Two (2) cards banned. \n6.7: One (1) card banned. New set added. \nAppendix D: Upcoming set added. \nJuly 25, 2025 \n3.7: New sets added. \n6.3: New sets added. \n6.4: New sets added. \n6.7: New sets added. \nAppendix D: Upcoming sets added. Some dates adjusted. \n \n\nAppendix B—Time Limits \nThe required minimum time limit for any match is 40 minutes. \nThe following time limits are recommended for each round of a tournament: \n• Constructed and Limited tournaments— 50 minutes \n• Single-elimination quarterfinal or semifinal matches— 90 minutes \n• Single-elimination final matches—no time limit \nThe following additional time limits are recommended for Limited tournaments: \n• Sealed Deck—20 minutes for deck registration and 30 minutes for deck construction. For P rereleases \nand Sealed Deck events that take place on the weekend of a new set release, 15 additional minutes for \ndeck construction is recommended. \n• Draft—25 minutes for deck registration and construction. \n• Team Sealed Deck—20 minutes for deck registration and 60 minutes for deck construction. For \nTeam-format Sealed Deck events that take place on the weekend of a new set release, 15 additional \nminutes for deck construction is recommended. \n• Team Draft—40 minutes for deck construction and registration. \n• Two-Headed Giant Sealed Deck—20 minutes for deck registration and 60 minutes for deck \nconstruction. For Two-headed Giant Sealed Deck events that take place on the weekend of a new set \nrelease, 15 additional minutes for deck construction is recommended. \n• Two-Headed Giant Draft— 40 minutes for deck construction and registration \nThe Head Judge of the tournament is the final authority on time limits for a tournament. However, any deviation \nfrom these recommendations must be announced prior to and during tournament registration. \nMagic Premier Tournaments may have different time limits. These time limits can be found in the tournament or \ntournament series fact sheet. \nIn timed rounds, players must wait for the officially tracked time to begin before starting their match. \n \n\nBooster Draft Timing \nIndividual Booster Drafts have the following default time limits for each pick: \nCards remaining in pack Time allotted \n15 cards 40 seconds \n14 cards 40 seconds \n13 cards 35 seconds \n12 cards 30 seconds \n11 cards 25 seconds \n10 cards 25 seconds \n9 cards 20 seconds \n8 cards 20 seconds \n7 cards 15 seconds \n6 cards 10 seconds \n5 cards 10 seconds \n4 cards 5 seconds \n3 cards 5 seconds \n2 cards 5 seconds \n1 card N/A \n \nThe time for review after the first booster pack is 60 seconds. Each subsequent review period increases by 30 \nseconds. \nRochester Draft Timing \nThe review period for a booster after it has been laid out on the table and before the first card is drafted is 20 \nseconds. Players have 5 seconds for each pick. \n\nTwo-Headed Giant Draft Timing \nTwo-Headed Giant Booster Drafts have the following default time limits for each pick: \nCards remaining in pack \n15-Card Booster 14-Card Booster Time allotted \n15 14 50 seconds \n13 12 45 seconds \n11 10 40 seconds \n9 8 30 seconds \n7 6 20 seconds \n5 4 10 seconds \n3 - 5 seconds \n1 2 N/A \n \nIn addition, players receive 60 seconds to review their drafted cards in between booster packs. \n\nAppendix C—Tiebreaker Explanation \nMatch Points \nPlayers earn 3 match points for each match win, 0 points for each match loss and 1 match point for each match \nending in a draw. Players receiving byes are considered to have won the match. \n• A player's record is 6–2–0 (Wins–Losses–Draws). That player has 18 match points (6*3, 2*0, 0*1). \n• A player's record is 4–2–2. That player has 14 match points (4*3, 2*0, 2*1). \nGame Points \nGame points are similar to match points in that players earn 3 game points for each game they win and 1 point for \neach game that ends in a draw, and 0 points for any game lost. Unfinished games are considered draws. Unplayed \ngames are worth 0 points. \n• A player wins a match 2–0–0, so they earn 6 game points and their opponent receives 0 game points \nfrom the match. \n• A player wins a match 2–1–0, so they earn 6 game points and their opponent earns 3 game points \nfrom the match. \n• A player wins a match 2–0–1, so they earn 7 game points and their opponent earns 1 game point from \nthe match. \nGame points are not used in team tournaments; only the overall result of the match is used for tiebreakers. \nMatch-win percentage \nA player’s match-win percentage is that player’s accumulated match points divided by the total match points \npossible in those rounds (generally, 3 times the number of rounds played). If this number is lower than 0.33, use \n0.33 instead. The minimum match-win percentage of 0.33 limits the effect low performances have when \ncalculating and comparing opponents’ match-win percentage. \nExamples: \nThese three players competed in an 8-round tournament, although only the first player completed all rounds. \nTournament \nRecord Match Points Rounds Played Match-win \nPercentage \n5-2-1 16 8 16/(8*3) = 0.667 \n1-3-0, then \nwithdraws 3 4 3/(4*3) = 0.25, so \n0.33 is used. \n3-2-0, including a \nfirst-round bye, then \nwithdraws \n9 5 9/(5*3) = 0.60 \n \n\nGame-win percentage \nSimilar to the match-win percentage, a player’s game-win percentage is the total number of game points they \nearned divided by the total game points possible (generally, 3 times the number of games played). Again, use 0.33 \nif the actual game-win percentage is lower than that. \nThese two players competed in a four-round tournament: \nGame Record by Match Game Points Games \nPlayed \nGame-win \nPercentage \n• Round 1: 2 wins (6 game points) \n• Round 2: 2 wins and 1 loss (6 game points) \n• Round 3: 1 win and 2 losses (3 game points) \n• Round 4: 2 wins (6 game points) \n21 10 21/(3*10) = 0.70 \n• Round 1: 1 win and 2 losses (3 game points) \n• Round 2: 1 win and 2 losses (3 game points) \n• Round 3: 2 losses (0 game points) \n• Round 4: 1 win and 2 losses (3 game points) \n9 11 9/(3*11) = 0.27, so \n0.33 is used. \n \nOpponents’ match-win percentage \nA player’s opponents’ match-win percentage is the average match-win percentage of each opponent that player \nfaced (ignoring those rounds for which the player received a bye). Use the match-win percentage definition listed \nabove when calculating each individual opponent’s match-win percentage. \nExamples: \n• A player’s record in an eight-round tournament is 6–2–0. Her opponents’ match records were: 4–4–0, \n7–1–0, 1–3–1, 3–3–1, 6–2–0, 5–2–1, 4–3–1, and 6–1–1, so her opponents’ match-win percentage is: \n \n\n• Another player’s record at the same tournament was 6–2–0. His opponents’ records were: bye, 7–1–0, \n1–3–1, 3–3–1, 6–2–0, 5–2–1, 4–3–1, and 6–1–1, so his opponents’ match-win percentage is: \n \n \n \nOpponents’ game-win percentages \nSimilar to opponents’ match-win percentage, a player’s opponents’ game-win percentage is simply the average \ngame-win percentage of all that player’s opponents. And, as with opponents’ match-win percentage, each \nopponent has a minimum game-win percentage of 0.33. \nByes \nWhen a player is assigned a bye for a round, they are considered to have won the match 2–0. \nThus, that player earns 3 match points and 6 game points. A player’s byes are ignored when computing their \nopponents’ match-win and opponents’ game-win percentages. \n\nAppendix D—Recommended Play Booster Mix for Limited Tournaments \nNote: The following play boosters mixes are required for Premier Play tournaments. \nFor Lorwyn Eclipsed, the recommended play booster mix for Limited tournaments is (effective January 16, 2026): \n• Individual Sealed Deck – 6 Lorwyn Eclipsed (per player) \n• Individual Booster Draft or Team Rochester Draft – 3 Lorwyn Eclipsed (per player) \n• Three-Person Team Sealed – 12 Lorwyn Eclipsed (per team) \n• Two-Headed Giant Sealed Deck – 8 Lorwyn Eclipsed (per team) \n• Two-Headed Giant Booster Draft – 6 Lorwyn Eclipsed (per team) \nFor Magic: The Gathering | Avatar: The Last Airbender, the recommended play booster mix for Limited \ntournaments is (effective November 14, 2025): \n• Individual Sealed Deck – 6 Magic: The Gathering | Avatar: The Last Airbender (per player) \n• Individual Booster Draft or Team Rochester Draft – 3 Magic: The Gathering | Avatar: The Last \nAirbender (per player) \n• Three-Person Team Sealed – 12 Magic: The Gathering | Avatar: The Last Airbender (per team) \n• Two-Headed Giant Sealed Deck – 8 Magic: The Gathering | Avatar: The Last Airbender (per team) \n• Two-Headed Giant Booster Draft – 6 Magic: The Gathering | Avatar: The Last Airbender (per team) \nFor Magic: The Gathering | Marvel’s Spider-Man, the recommended play booster mix for Limited tournaments is \n(effective September 19, 2025 to November 13, 2025): \n• Individual Sealed Deck – 6 Magic: The Gathering | Marvel’s Spider-Man (per player) \n• Individual Booster Draft or Team Rochester Draft – 3 Magic: The Gathering | Marvel’s Spider-Man \n(per player) \n• Three-Person Team Sealed – 12 Magic: The Gathering | Marvel’s Spider-Man (per team) \n• Two-Headed Giant Sealed Deck – 8 Magic: The Gathering | Marvel’s Spider-Man (per team) \n• Two-Headed Giant Booster Draft – 6 Magic: The Gathering | Marvel’s Spider-Man (per team) \nFor Edge of Eternities, the recommended play booster mix for Limited tournaments is (effective July 25, 2025 \nthrough November 13, 2025): \n• Individual Sealed Deck – 6 Edge of Eternities (per player) \n• Individual Booster Draft or Team Rochester Draft – 3 Edge of Eternities (per player) \n• Three-Person Team Sealed – 12 Edge of Eternities (per team) \n• Two-Headed Giant Sealed Deck – 8 Edge of Eternities (per team) \n• Two-Headed Giant Booster Draft – 6 Edge of Eternities (per team) \n\nAppendix E— Recommended Number of Rounds in Swiss Tournaments \nThe following number of Swiss rounds is required for Premier tournaments (such as Regional Championship \nQualifiers). It may be used at the Tournament Organizer’s discretion for non-Premier tournaments. \n \nPlayers (Teams) Swiss Rounds Playoff \n4 (Team/2HG Only) 2 Single-Elimination \nRounds (No Swiss) None (Run Single Elimination) \n5-8 3 Single-Elimination \nRounds (No Swiss) None (Run Single Elimination) \n9-16 \n4 (if Limited Format with \nBooster Draft in Playoff) \n5 (All Other Formats) \nTop 8 (If Limited Format with \nBooster Draft in Playoff) \nTop 4 (All Other Formats) \n17-32 5 Top 8 \n33-64 6 Top 8 \n65-128 7 Top 8 \n129-226 8 Top 8 \n227-409 9 Top 8 \n410+ 10 Top 8 \n \nTeam tournaments consider each team as a single player for this purpose. \nIn tournaments where awarded byes are used, each player with a 1-round bye should count as 2 players, each \nplayer with a 2-round bye should count as 4 players, and each player with a 3-round bye should count as 8 players \nwhen using the above chart. \n \n\nAppendix F—Rules Enforcement Levels of Programs \nThe following chart indicates the appropriate (minimum) Rules Enforcement level for various programs: \nProgram Rules Enforcement Level \nEternal Weekend Competitive \nFriday Night Magic Regular \nGame Day Regular (Competitive recommended) \nLaunch Party Regular \nLimited Championship Professional \nPrerelease Regular \nPro Tour Professional \nPro Tour Qualifier Competitive \nRegional Championships Competitive \nRegional Championship Qualifiers Competitive \nSpotlight Series – Day 1 Competitive \nSpotlight Series – Day 2 Professional \nStore Championship Regular (Competitive recommended) \nWorld Championship Professional \n \n \n \n \n \n \n \n \n \n \n \n \nAll trademarks are property of Wizards of the Coast LLC in the U.S.A. and other countries. ©2025 Wizards. \n©2025 Viacom International Inc. All Rights Reserved. Nickelodeon, Nickelodeon Avatar: The Last Airbender and all related titles, logos \nand characters are trademarks of Viacom International Inc. \n© 2025 MARVEL \n© SQUARE ENIX IMAGE ILLUSTRATION:© YOSHITAKA AMANO \n© 2024 Ubisoft Entertainment. All rights reserved. Assassin’s Creed, Ubisoft and the Ubisoft logo are registered or unregistered \ntrademarks of Ubisoft Entertainment in the U.S. and/or other countries. \n© Middle-earth Enterprises. The Lord of the Rings and Tales of Middle-earth are trademarks of Middle-earth Enterprises, LLC used under \nlicense by Wizards of the Coast LLC."
    }
  ]
}