{
  "section_number": 5,
  "title": "5. Tournament Violations",
  "section_key": "mtr_section_5",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "5.1",
      "title": "Cheating",
      "content": "Cheating will not be tolerated. The Head Judge reviews all cheating allegations, and if they believe that a player has cheated, they will issue the appropriate penalty based on the Infraction Procedure Guide or Judging at Regular Rules Enforcement Level document. All disqualifications are subject to DCI review and further penalties may be assessed."
    },
    {
      "number": "5.2",
      "title": "Bribery",
      "content": "The decision to drop, concede, or agree to an intentional draw cannot be made in exchange for or influenced by\nthe offer of any outside-the-game reward or incentive, nor may any in-game decision be influenced in this\nmanner. Making such an offer or enticing someone into making an offer is prohibited and is considered bribery. Players may not make any offers to tournament officials in an attempt to influence the outcome of a ruling. It is not bribery when players share prizes they have not yet received in the current tournament and they may agree to such before or during their match, as long as any such sharing does not occur in exchange for any game or match result or the dropping of a player from the tournament.\n\nIt is not bribery when players in the announced last round of the single-elimination portion of a tournament agree to a winner and how to divide the subsequent tournament prizes. In that case, one of the players at each table must agree to drop from the tournament. Players receive the prizes according to their final ranking.\n\nThe result of a match or game may not be randomly or arbitrarily determined through any means other than the normal progress of the game in play. Examples include (but are not limited to) rolling a die, flipping a coin, arm wrestling, or playing any other game. Players may not reach an agreement in conjunction with other matches. Players can make use of information regarding match or game scores of other tables. However, players are not allowed to leave their seats during their match or go to great lengths to obtain this information.\n\nPlayers in the single-elimination rounds of a tournament offering only cash, store credit, prize tickets, and/or\nunopened product as prizes may, with the permission of the Tournament Organizer, agree to split the prizes\nevenly. The players may end the tournament at that point or continue to play. All players still in the tournament must agree to the arrangement.\n\nExample: Before the semifinals of a tournament (in which first place gets 12 packs, second place gets 8 packs and 3rd and 4th get 4 packs each) begins, the players may get permission from the Tournament Organizer to end the tournament, with each player receiving 7 packs. Example: In the finals of a 1-slot Players Tour Qualifier that offers a travel award and an invitation to the winner, the two finalists may agree to split the tournament prizes, but this agreement cannot alter the results of the match. One player must drop from the tournament, leaving the travel award and the invitation to the player who did not drop from the tournament. That player is then free to split the remainder of the prizes as agreed upon. The travel award and invitation are a single item and may not be split."
    },
    {
      "number": "5.3",
      "title": "Wagering",
      "content": "Tournament participants, tournament officials, and spectators may not wager, ante, or bet on any portion (including the outcome) of a tournament, match, or game."
    },
    {
      "number": "5.4",
      "title": "Unsporting Conduct",
      "content": "Unsporting conduct will not be tolerated at any time. Tournament participants must behave in a polite and respectful manner. Unsporting conduct includes, but is not limited to:\n\n• Using profanity.\n• Engaging in behavior that could reasonably be expected to create a feeling of being harassed, bullied, or stalked.\n• Arguing with, acting belligerently toward, or insulting tournament officials, players, or spectators.\n• Violating the personal privacy or safety of any participant, including spectators and staff.\n• Using social media to bully, shame, or intimidate other participants.\n• Failing to follow the instructions of a tournament official.\n\nOfficials are expected to investigate potential matters brought their attention as soon as possible and take actions to discourage repeat behavior. All incidents of unsporting conduct are subject to further DCI review."
    },
    {
      "number": "5.5",
      "title": "Slow Play",
      "content": "Players must take their turns in a timely fashion regardless of the complexity of the play situation and adhere to time limits specified for the tournament. Players must maintain a pace to allow the match to be finished in the announced time limit. Stalling is not acceptable. Players may ask a judge to watch their game for slow play; such a request will be granted if feasible."
    },
    {
      "number": "5.6",
      "title": "Outside Assistance",
      "content": "During matches, players may not seek play advice from spectators and spectators may not give play advice to\nplayers.\n\nDuring deck construction, players and spectators may not provide any advice or commentary to a player until that player’s decklist has been handed in. Players and spectators will refrain from providing any information about draft selections or strategies between pod announcement and the end of the draft. At Competitive and Professional Rules Enforcement Level, players and spectators are expected to remain silent during the draft.\n\nSome of these restrictions may be waived due to official press or coverage; in these situations, the player will be informed of the revised expectations. Teammates in certain team tournaments are also excepted from these restrictions (see section 4.5)."
    }
  ]
}