{
  "section_number": 1,
  "title": "1. Tournament Fundamentals",
  "section_key": "mtr_section_1",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "1.1",
      "title": "Tournament Types",
      "content": "There are two types of sanctioned Magic tournaments: rated and casual. \nRated tournaments are further divided into two types: Premier and non-Premier. Premier tournaments are run by \nWizards of the Coast or select Tournament Organizers. They have unique names and features. Non-Premier \ntournaments are tournaments that are not explicitly Premier. \nThere are two major tournament formats: Limited and Constructed. Each has rules specific to its format. In \nLimited tournaments, all product for play is provided during the tournament. In Constructed tournaments, players \ncompete using decks prepared beforehand. Some Premier tournaments may consist of multiple formats within the \nsame tournament."
    },
    {
      "number": "1.2",
      "title": "Publishing Tournament Information",
      "content": "Wizards of the Coast reserves the right to publish DCI-sanctioned tournament information at any time (including \nduring the tournament). Tournament information includes, but is not limited to, the contents of one or more \nplayers' decks, descriptions of strategies or play, transcripts, and video reproductions. Tournament Organizers are \nalso allowed to publish this information once their tournament is complete. \nWizards of the Coast reserves the right to publish penalty and suspension information."
    },
    {
      "number": "1.3",
      "title": "Tournament Roles",
      "content": "The following roles are defined for tournament purposes: \n• Tournament Organizer \n• Head Judge \n• Floor Judge` \n• Scorekeeper \n• Player \n• Spectator \nThe first four roles above are considered tournament officials. The Head Judge and floor judges are collectively \nconsidered judges. A single individual may act in any combination of tournament official roles. Individuals who \nare not judges at a tournament are spectators in any match in which they are not playing. Members of the press are \nalso considered spectators."
    },
    {
      "number": "1.4",
      "title": "Participation Eligibility",
      "content": "Anyone is eligible to participate as a player in a DCI-sanctioned tournament except for: \n• Individuals currently suspended by the DCI. Individuals currently suspended from the DCI may not \nact as tournament officials; \n• Other individuals specifically prohibited from participation by DCI or Wizards of the Coast policy \n(such determination is at Wizards of the Coast’s sole discretion); \n• Individuals thirteen (13) years of age and younger who do not have their parent/guardians’ \npermission; \n• Anyone prohibited by federal, state, or local laws, the rules of the Tournament Organizer, or by a \nvenue’s management. \n\n• Tournament Organizers may choose to age restrict any Regular REL events that they organize. They \nmust clearly indicate this in their marketing for the event on the Store and Event Locator description \nas well as any other place they display the event information. (i.e., Tournament Organizers may \nadvertise an age 16 and under Friday Night Magic). \nAnyone is eligible to participate as a tournament official (Tournament Organizer, Head Judge, floor judge or \nScorekeeper) for a tournament except for: \n• Individuals currently suspended by the DCI; \n• Anyone who has played in the tournament, unless it is a tournament that explicitly allows tournament \nofficials to play while acting as a tournament official. \nTournament officials may play in a DCI-sanctioned, rated tournament for which they are a tournament official if \n(and only if) the tournament is of the following types: \n• Friday Night Magic \n• Prerelease \n• Launch Parties \n• Game Day \n• Store Championship \n• Other non-Premier Magic Tournaments \n• Tournaments in which the official Wizards of the Coast tournament fact sheet specifically permits \nofficials of that tournament to play \nIf one or more tournament officials play in the tournament, it must be run at Regular Rules Enforcement Level. If \ntournament officials play in the tournament and the tournament is not one of the allowed types listed above, the \ntournament will be invalidated. Tournament officials are required to officiate tournaments fairly and without \nregard to their own self-interest. \nThe owners of organizations that run Premier Events are not permitted to play in those tournaments, even if the \nowner is not listed as a tournament official (organizer, judge, and/or scorekeeper) for that tournament. \nPremier Events include the following tournaments: Magic: The Gathering World Championship, Pro Tour, \nMagic: The Gathering Limited Championship, Pro Tour Qualifier, Spotlight Series, Regional Championship, \nRegional Championship Qualifier. \nSome tournaments have additional criteria regarding player and tournament official eligibility (e.g., invitation-\nonly tournaments, such as World Championship, Pro Tour, Limited Championship, and Regional \nChampionships). \nThe Premier Tournament Invitation Policy defines specific eligibility rules with regards to certain types of \ninvitation-only Premier Tournaments. \nIndividuals with questions regarding their tournament eligibility should contact PremierPlay@wizards.com."
    },
    {
      "number": "1.5",
      "title": "Registration",
      "content": "In order to participate in Magic: The Gathering tournaments, players must be able to provide the necessary and \nappropriate identifying information to participate in the tournament. \nFor tournaments run using the EventLink tournament management software, players must provide a Wizards \nAccount and/or a first and last name. Players without a Wizards Account should obtain one from \nhttps://myaccounts.wizards.com."
    },
    {
      "number": "1.6",
      "title": "Tournament Organizer",
      "content": "The Tournament Organizer of a tournament is responsible for all tournament logistics including: \n• Sanctioning the event. \n• Providing a site for the tournament that meets the tournament’s expected needs. \n• Advertising the tournament in advance of the tournament date. \n• Staffing the tournament with appropriate tournament officials. \n• Providing all materials necessary to operate the tournament (e.g., product for Limited format \ntournaments)."
    },
    {
      "number": "1.7",
      "title": "Head Judge",
      "content": "Sanctioned tournaments require the physical presence of a Head Judge during play to adjudicate disputes, \ninterpret rules, and make other official decisions. The Head Judge is the final judicial authority at any DCI-\nsanctioned tournament and all tournament participants are expected to follow their interpretations. Although it is \nbeneficial, the Head Judge does not have to be certified. \nThe Head Judge’s responsibilities include: \n• Ensuring that all necessary steps are taken to deal with game or policy rule violations that they notice \nor are brought to their attention. \n• Issuing the final ruling in all appeals, potentially overturning the ruling of a floor judge. \n• Coordinating and delegating tasks to floor judges as needed. \nIf necessary, the Head Judge may temporarily transfer their duties to any judge if they are unable to fulfill them \nfor a period of time. Also, in exceptional circumstances, if the tournament’s integrity would be damaged \notherwise, the Tournament Organizer may replace the Head Judge. \nCertain Premier tournaments have multiple Head Judges and/or different Head Judges for different portions of the \ntournament. All Head Judges share the same responsibilities and exercise the same authority while they are \nserving as a Head Judge."
    },
    {
      "number": "1.8",
      "title": "Floor Judges",
      "content": "Floor judges are available to players and spectators to answer questions, deal with illegal plays, or assist with \nreasonable requests. They do not have to be certified. \nJudges will not generally assist players in determining the current game state but can answer questions about the \nrules, interactions between cards, or provide the Oracle™ wordings of relevant cards. At Regular Rules \nEnforcement Level, the judge may assist the player in understanding the game state in the interest of education. If \na player wishes to ask their question away from the table, the request will usually be honored. Players may not \nrequest specific judges to answer their calls but may request a tournament official to help translate. This request \nmay be honored at the discretion of the original judge. \nJudges do not intervene in a game to prevent illegal actions but do intervene as soon as a rule has been broken or \nto prevent a situation from escalating."
    },
    {
      "number": "1.9",
      "title": "Scorekeeper",
      "content": "The Scorekeeper ensures the correct generation of pairings and all other tournament records throughout the \ntournament. The Scorekeeper’s responsibilities include: \n\n• Generating correct pairings each round and accurately entering the results of those rounds. \n• Generating standings for posting before and after the final Swiss round. Other rounds may also be \nposted at the Head Judge’s discretion. \n• Solving all scorekeeping problems that arise in consultation with the Head Judge. \n• Making sure all necessary information is included in the tournament’s report. \nThe Head Judge has the final authority in determining corrective action for scorekeeping errors."
    },
    {
      "number": "1.10",
      "title": "Players",
      "content": "Players are responsible for: \n• Behaving in a respectful manner toward tournament officials, other tournament participants, and \nspectators and refraining from unsporting conduct at all times. \n• Maintaining a clear and legal game state. \n• Complying with announced start times and time limits. \n• Calling attention to any rules or policy infraction they notice in their matches. \n• Bringing to a judge’s attention any discrepancies in their tournament match record. \n• Accurately reporting the results of their matches in a timely manner. \n• Refraining from enrolling in tournaments in which they are not allowed by policy to participate. \n• Being familiar with the rules contained within this document. \n• Being physically present for the tournament. \nA player must bring the following items to a tournament in order to participate: \n• A physical, visible, and reliable method to maintain and record game information (tokens, score \ncounters, pen and paper, and so on). \n• Any materials specifically required for a particular tournament format, such as assembled decks \nand/or decklists for constructed tournaments. \nPlayers retain their responsibilities even if a judge provides them with extra assistance. \nThe individual members of a team are considered players, and are equally responsible for required tournament \nprocedures, such as accurately reporting the results of their match. Players are only responsible for the games they \nplay themselves and not separate games being played by their teammates but are expected to point out rules \nviolations they observe in their teammates’ matches. \nPlayers who do not fulfill their responsibilities may be subject to penalties and review by the DCI. Wizards of the \nCoast and the DCI reserve the right to suspend or revoke a player's membership without prior notice for any \nreason they deem necessary."
    },
    {
      "number": "1.11",
      "title": "Spectators",
      "content": "Any person physically present at a tournament and not in any other category above is a spectator. Spectators are \nresponsible for remaining silent and passive during matches and other official tournament sections in which \nplayers are also required to be silent. If spectators believe they have observed a rules or policy violation, they are \nencouraged to alert a judge as soon as possible. At Regular or Competitive Rules Enforcement Level, spectators \nare permitted to ask the players to pause the match while they alert a judge. At Professional Rules Enforcement \nLevel, spectators who are not members of the official coverage team must not interfere with the match directly. \nPlayers may request that a spectator not observe their matches. Such requests must be made through a judge. \nTournament officials may also instruct a spectator not observe a match or matches."
    },
    {
      "number": "1.12",
      "title": "Rules Enforcement Levels",
      "content": "Rules Enforcement Levels (REL) are a means to communicate to the players and judges what expectations they \ncan have of the tournament in terms of rigidity of rules enforcement, technically correct play, and procedures \nused. \nThe Rules Enforcement Level of a tournament generally reflects the prizes awarded and the distance a player may \nbe expected to travel. \nThe appropriate Rules Enforcement Level for specific programs is listed in Appendix F. \nRegular \nRegular tournaments are focused on fun and social aspects, not enforcement. Most tournaments are run at this \nlevel unless they offer sizeable prizes or invitations. Players are expected to know most of the game rules, may \nhave heard of policy and what is “really bad,” but generally play in a fashion similar to the way they do casually. \nPlayers are still responsible for following the rules, but the focus is on education and sportsmanship over \ntechnically precise play. Infractions in these tournaments are covered by the Judging at Regular Rules \nEnforcement Level document, located at https://wpn.wizards.com/en/rules-documents. \nCompetitive \nCompetitive tournaments are usually those with significant cash prizes or invitations awarded to Professional \ntournaments. Players are expected to know the game’s rules and be familiar with the policies and procedures, but \nunintentional errors are not punished severely. These are tournaments that protect the interests of all players by \nproviding tournament integrity while also recognizing that not all players are intimately familiar with \nProfessional-level tournament structure, proper procedures, and rules. Infractions in these tournaments are \ncovered by the Magic Infraction Procedure Guide, located athttps://wpn.wizards.com/en/rules-documents. \nProfessional \nProfessional level tournaments offer large cash awards, prestige, and other benefits that draw players from great \ndistances. These tournaments hold players to a higher standard of behavior and technically-correct play than \nCompetitive tournaments. Infractions in these tournaments are covered by the Magic Infraction Procedure Guide, \nlocated athttps://wpn.wizards.com/en/rules-documents."
    }
  ]
}