{
  "section_number": "C",
  "title": "Appendix C—Tiebreaker Explanation",
  "section_key": "mtr_appendix_c",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "C",
      "title": "Tiebreaker Explanation",
      "content": "Appendix C—Tiebreaker Explanation\n\nMatch Points Players earn 3 match points for each match win, 0 points for each match loss and 1 match point for each match ending in a draw. Players receiving byes are considered to have won the match.\n\n• A player's record is 6–2–0 (Wins–Losses–Draws). That player has 18 match points (6*3, 2*0, 0*1).\n• A player's record is 4–2–2. That player has 14 match points (4*3, 2*0, 2*1).\n\nGame Points\n\nGame points are similar to match points in that players earn 3 game points for each game they win and 1 point for\neach game that ends in a draw, and 0 points for any game lost. Unfinished games are considered draws. Unplayed\ngames are worth 0 points.\n• A player wins a match 2–0–0, so they earn 6 game points and their opponent receives 0 game points from the match.\n• A player wins a match 2–1–0, so they earn 6 game points and their opponent earns 3 game points from the match.\n• A player wins a match 2–0–1, so they earn 7 game points and their opponent earns 1 game point from the match.\n\nGame points are not used in team tournaments; only the overall result of the match is used for tiebreakers.\n\nMatch-win percentage\n\nA player’s match-win percentage is that player’s accumulated match points divided by the total match points possible in those rounds (generally, 3 times the number of rounds played). If this number is lower than 0.33, use 0.33 instead. The minimum match-win percentage of 0.33 limits the effect low performances have when calculating and comparing opponents’ match-win percentage. Examples:\n\nThese three players competed in an 8-round tournament, although only the first player completed all rounds.\n\nTournament Match-win Match Points Rounds Played Record Percentage 5-2-1 16 8 16/(8*3) = 0.667 1-3-0, then 3/(4*3) = 0.25, so 3 4 withdraws 0.33 is used. 3-2-0, including a first-round bye, then 9 5 9/(5*3) = 0.60 withdraws\n\nGame-win percentage\n\nSimilar to the match-win percentage, a player’s game-win percentage is the total number of game points they earned divided by the total game points possible (generally, 3 times the number of games played). Again, use 0.33 if the actual game-win percentage is lower than that.\n\nThese two players competed in a four-round tournament:\n\nGames Game-win\nGame Record by Match Game Points\nPlayed Percentage\n• Round 1: 2 wins (6 game points)\n• Round 2: 2 wins and 1 loss (6 game points) 21 10 21/(3*10) = 0.70\n• Round 3: 1 win and 2 losses (3 game points)\n• Round 4: 2 wins (6 game points)\n• Round 1: 1 win and 2 losses (3 game points) 9/(3*11) = 0.27, so\n• Round 2: 1 win and 2 losses (3 game points) 9 11 0.33 is used.\n• Round 3: 2 losses (0 game points)\n• Round 4: 1 win and 2 losses (3 game points) Opponents’ match-win percentage A player’s opponents’ match-win percentage is the average match-win percentage of each opponent that player faced (ignoring those rounds for which the player received a bye). Use the match-win percentage definition listed above when calculating each individual opponent’s match-win percentage.\n\nExamples:\n\n• A player’s record in an eight-round tournament is 6–2–0. Her opponents’ match records were: 4–4–0, 7–1–0, 1–3–1, 3–3–1, 6–2–0, 5–2–1, 4–3–1, and 6–1–1, so her opponents’ match-win percentage is:\n\n• Another player’s record at the same tournament was 6–2–0. His opponents’ records were: bye, 7–1–0, 1–3–1, 3–3–1, 6–2–0, 5–2–1, 4–3–1, and 6–1–1, so his opponents’ match-win percentage is:\n\nOpponents’ game-win percentages\n\nSimilar to opponents’ match-win percentage, a player’s opponents’ game-win percentage is simply the average game-win percentage of all that player’s opponents. And, as with opponents’ match-win percentage, each opponent has a minimum game-win percentage of 0.33. Byes\n\nWhen a player is assigned a bye for a round, they are considered to have won the match 2–0.\n\nThus, that player earns 3 match points and 6 game points. A player’s byes are ignored when computing their opponents’ match-win and opponents’ game-win percentages."
    }
  ]
}