{
  "section_number": 8,
  "title": "8. Team Tournament Rules",
  "section_key": "mtr_section_8",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "8.1",
      "title": "Team Names",
      "content": "Wizards of the Coast reserves the right to disallow any team name it deems offensive and/or obscene. Tournament officials may disallow teams from registering team names that may be considered offensive and/or obscene."
    },
    {
      "number": "8.2",
      "title": "Team Composition and Identification",
      "content": "A valid team consists of two or three members, as appropriate to the format. A team is identified by the individual registration information (Wizards Account) of its respective members and all teams must provide the Tournament Organizer with the full information when registering for the tournament. Individuals may be members of more than one team, though not during the same tournament. If a player drops from the tournament, the entire team is dropped from the tournament. If a player is disqualified from the tournament, the entire team is disqualified from the tournament. Teams must designate player positions during tournament registration. For example, in a three-player team tournament, each team must designate who is player A, player B, and player C. Players retain these designations throughout the entire tournament.\n\nWhen two teams are paired against each other during the course of a tournament, the team members designated as “player A” play against each other, the team members designated as “player B” play against each other, and so on."
    },
    {
      "number": "8.3",
      "title": "Team Communication Rules",
      "content": "The rules for team communication are the same as those for Two-Headed Giant. See section 4.6 for more details."
    },
    {
      "number": "8.4",
      "title": "Unified Deck Construction Rules",
      "content": "Team Constructed tournaments use Unified Deck Construction rules: Except for cards with the basic supertype, no two decks on a team may contain the same card, based on its English card title. (For example, if one player is using Naturalize in a Team Constructed tournament, no other player on that team may use Naturalize in their deck.) No players may use cards that are banned in a particular format. Cards that override deck construction rules (i.e., Relentless Rats) may only override them for one deck on a team.\n\nUnified Deck Construction rules are only applied when all members of a team have decks of the same format."
    },
    {
      "number": "8.5",
      "title": "Team Rochester Draft Tournaments",
      "content": "Team Rochester Draft tournaments require teams of three players each. Two teams are seated at each table for the draft. Team members sit clockwise in A-B-C order around the table. (For example, in a three-person team tournament, players sit around the table clockwise in this order: 1A, 1B, 1C, 2A, 2B, 2C.)\n\nA team determined at random chooses either to pick first or to allow the other team to pick first. Player B of the team that picks first lays out the first pack. The draft begins with the first player opening their first booster and laying out the entire contents of the pack face up on the table as directed by tournament officials, with the cards facing them. After reviewing the cards, drafting proceeds with each player selecting a single card in turn. Once a player has selected a card and placed it with their other drafted cards, they may not select a different card. If a player fails to select a card in the time given, a tournament official selects for that player the “oldest” card remaining from the booster pack (the card on the table the longest).\n\nThe player drafting first from the cards presented on the table is called the active player. The first active player is the participant who opened the first booster pack of the draft, as designated by a tournament official. All players in each drafting pod serve as the active player once for each group of booster packs. The identity of the active player moves in a horseshoe pattern, clockwise for the first and third booster packs and counterclockwise for the second. The player who was last to open a booster pack from a group is the first to open the booster pack from the next group. The draft order also begins moving in a horseshoe pattern, clockwise for the first and third boosters and counterclockwise for the second, beginning with the active player, continuing around the table to the last player in the group to draft a card. The last player in the group selects two cards sequentially, and then drafting continues in reverse order, moving back to the player who began the drafting. If there are still cards remaining, the player who began the drafting selects two cards, and drafting continues again in the opposite direction.\n\nExample: Team 1 and Team 2 are seated around a table. They are numbered 1A-1B-1C-2A-2B-2C in a clockwise order. Team 2 wins the coin toss, and the members of Team 2 choose to let Team 1 pick first. The active player for the first pack is Player 1B. The first booster pack for Player 1B is opened and placed face up in front of Player 1B. After the 20-second review period has expired, the draft order is as follows:\n\nPlayer 1B—card 1 Player 1A—card 6 Player 1C—card 11 Player 1C—card 2 Player 1A—card 7 Player 1B—card 12 Player 2A—card 3 Player 2C—card 8 Player 1B—card 13 Player 2B—card 4 Player 2B—card 9 Player 1C—card 14 Player 2C—card 5 Player 2A—card 10 Player 2A—card 15 During card selection, players must display the most recent card they drafted from the current pack. At all other times, players may leave one of their drafted cards face up on their draft pile or may leave all cards face down. Players may not review their draft picks while drafting proceeds or at any other time specifically indicated by tournament officials."
    },
    {
      "number": "8.6",
      "title": "Team Sealed Deck Tournaments",
      "content": "All the rules for individual Limited tournaments (Section 7) apply to Team Sealed Deck tournaments except as follows. Each team must receive the same product mix. For example, if one team receives twelve Murders at Karlov Manor play boosters, every team must receive twelve Murders at Karlov Manor play boosters.\n\nEight boosters per team are recommended for two-person team tournaments, and twelve boosters per team for three-person team tournaments. For the recommended product mix for the current block, refer to Appendix D.\n\nAll cards must be assigned to a player’s deck or sideboard during deck construction and cannot be transferred to another player during that tournament. (Players do not share main deck or sideboard cards.) Players may exchange cards in their pool in Regular Rules Enforcement Level tournaments that do not use decklists, but only between rounds."
    }
  ]
}