{
  "section_number": 7,
  "title": "7. Limited Tournament Rules",
  "section_key": "mtr_section_7",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "7.1",
      "title": "Deck Construction Restrictions",
      "content": "Limited decks must contain a minimum of forty cards. There is no maximum deck size. Any drafted or opened cards not used in a player’s Limited deck function as their sideboard.\n\nPlayers are not restricted to four of any one card in Limited tournament play."
    },
    {
      "number": "7.2",
      "title": "Card Use in Limited Tournaments",
      "content": "Cards must be received directly from tournament officials. This product must be new and previously unopened. Pro Tour, Limited Championship, Spotlight Series, Regional Championships, and World Championship tournaments may have had play boosters opened in order to stamp them. Each player (or team) must be given exactly the same quantity and type of product as all other players participating in the tournament. For example, if one player receives three Murders at Karlov Manor play boosters for a Booster Draft, all other players must also receive three Murders at Karlov Manor play boosters.\n\nOnly cards from the expansions of the play boosters opened (and only cards opened or drafted in that player’s pool) may be used in a player’s deck. The following are exceptions to this rule:\n\n• Players may add an unlimited number of cards named Plains, Island, Swamp, Mountain, or Forest to their deck and sideboard. They may not add additional snow basic land cards (e.g., Snow-Covered Forest, etc) or Wastes basic land cards, even in formats in which they are legal. • Non-basic lands from the Return to Ravnica and Gatecrash expansions are allowed when opened in Dragon’s Maze draft boosters. • Non-basic lands from the Khans of Tarkir expansion are allowed when opened in Fate Reforged draft boosters. • Non-basic lands from the Zendikar Expeditions set are allowed when opened in Battle for Zendikar or Oath of the Gatewatch draft boosters. • Cards from a Masterpiece Series are allowed when opened in draft boosters associated with that series. • Prerelease tournaments may feature additional exceptions. These will be announced as part of the Prerelease information.\n\nPlayers may ask a judge for permission to replace a card with another version of the same card. Because it was designed specifically for multiplayer play, the use of Conspiracy booster packs in sanctioned, rated Limited-format tournaments (Sealed Deck and Booster Draft) is not permitted.\n\nSix play boosters per player are recommended for individual format Sealed Deck tournaments and 3 play boosters per player for individual Booster or Team Rochester Draft tournaments. For the recommended product mix for the current block, refer to Appendix D.\n\nIf the Tournament Organizer allows players to provide their own product, that product must be pooled with the rest of the product for the tournament and randomly distributed. If the Tournament Organizer is not providing extra land cards for use in a Limited tournament, they must announce this before tournament registration. Tournament Organizers may require players to return these land cards when they leave the tournament. Players may use their own basic lands during tournaments."
    },
    {
      "number": "7.3",
      "title": "Continuous Construction",
      "content": "Players participating in Limited tournaments that do not use decklists may freely change the composition of their decks between matches by exchanging cards from their deck for cards in their sideboard without being required to return their deck to its original composition before their next match. The Head Judge or Tournament Organizer must inform players if this option is not being used prior to the start of deck construction. This option is not available at Competitive or Professional Rules Enforcement Level tournaments."
    },
    {
      "number": "7.4",
      "title": "Abnormal Product",
      "content": "Neither Wizards of the Coast nor the Tournament Organizer guarantee any specific distribution of card rarities or frequency in a particular booster pack or tournament pack. If a player receives an unconventional distribution of rarities or frequencies in a particular booster pack or tournament pack, they must call a judge. The final decision to replace or allow the atypical product is at the discretion of the Head Judge and the Tournament Organizer."
    },
    {
      "number": "7.5",
      "title": "Sealed Deck Pool Registration",
      "content": "In Sealed Deck tournaments, the Head Judge may require players to perform a Sealed Deck pool registration procedure prior to deck construction:\n\n• Each player is distributed the appropriate number of boosters. The booster packs should be marked in a way that distinguishes they came from the Tournament Organizer for that tournament. • Players on one side of each table open their booster packs (Player A). The player directly across (Player B) observes this. Both players will observe and verify the contents of those booster packs. After this process, the opened cards are stacked face down in a single pile and placed near Player B. • Player B will now open their booster packs. Player A observes. Both players will observe and verify the contents. After this process, the opened cards are stacked face down in a single pile and placed near Player A. • Player A then sorts and registers the contents of Player B's pool, and vice versa. • After registration, each player returns the registered card pool to the player who originally opened the pool. • Players construct and record decks as normal."
    },
    {
      "number": "7.6",
      "title": "Draft Pod Assembly",
      "content": "For Booster Draft and Team Rochester Draft tournaments, players assemble into random drafting circles (called pods) of roughly equal size at the direction of the Head Judge. Tournament officials then distribute identical sets of boosters to each player. Players within a pod may play only against other players within that pod. In Regular Rules Enforcement Level tournaments, the Tournament Organizer may elect to lift this restriction. This must be announced before the tournament starts."
    },
    {
      "number": "7.7",
      "title": "Booster Draft Procedures",
      "content": "All players must open and draft the same type of booster at the same time. Players open their first booster pack and count the cards face down, removing token cards, rules cards, and any other non-game cards. Players who receive an erroneous number of cards at any time must immediately notify a judge. Players choose one card from their current booster pack and then pass the remaining cards face down to the player on their left until all cards are drafted (Exception: When the Booster Draft consists of Double Masters boosters, players choose two cards for their first pick from each booster. All other Booster Draft rules remain the same). Once a player has removed a card from the pack and put it on top of their single, front face-down drafted pile, it is considered selected and may not be returned to the pack.\n\nPlayers may not reveal the front face of their card selections or the contents of their current packs to other participants in the draft and must make a reasonable effort to keep that information from the sight of other players. Players are not permitted to reveal hidden information of any kind to other participants in the draft regarding their own picks or what they want others to pick. (Exception: This does not apply to double-faced cards, both faces of which may be revealed at any time during a draft.)\n\nPlayers and teams may not look at their drafted cards between or during picks at Competitive and Professional Rules Enforcement Levels. At Regular Rules Enforcement Level, players are allowed to review their drafted cards between or during picks as long as they are holding no other cards at the same time. The Head Judge may choose to disallow this provided they announce it before the first draft. Between booster packs there is a review period in which players may review their picks. If the draft is not being timed, and two players do not wish to make a pick before the other player, the player closer to providing the other player with the pack picks first. If the players are equidistant, then the player in the lower seat number picks first.\n\nAfter the first pack is drafted and the review period completed, players open the next pack and draft in the same fashion, except that the direction of drafting is reversed—it now proceeds to the right. This process is repeated, reversing the direction of drafting for each booster pack until all cards in all booster packs are drafted.\n\nIf a player is unable or unwilling to continue drafting, but wishes to remain in the tournament, they are suspended from drafting and must construct a deck from whatever cards they have drafted thus far. For the remainder of the draft, their picks are skipped and the draft continues with one fewer player."
    }
  ]
}