{
  "section_number": 2,
  "title": "2. Tournament Mechanics",
  "section_key": "mtr_section_2",
  "metadata": {
    "effective_date": "November 10, 2025"
  },
  "rules": [
    {
      "number": "2.1",
      "title": "Match Structure",
      "content": "A match consists of a series of games that are played until one side has won a set number of games, usually two. Drawn games do not count toward this goal. If the round ends before a player has won the required number of games, the winner of the match is the player who has won the most games at that point. If both players have equal game wins, the match is a draw.\n\nThe Tournament Organizer may change the required number of games to be won for any portion of the tournament as long as this choice is announced before the tournament begins. Match results, not individual game results, are reported at the end of the tournament."
    },
    {
      "number": "2.2",
      "title": "Play/Draw Rule",
      "content": "For the first game of a match, a designated player - the winner of a random method (such as a die roll or coin toss) during Swiss rounds, or the player ranked higher at the end of Swiss rounds during playoff matches - chooses either to play first or to play second. They must state this choice before looking at their hand. If they state no choice, it is assumed that they are playing first. The player who plays first skips the draw step of their first turn. This is referred to as the play/draw rule.\n\nAfter each game in a match, the loser of that game decides whether to play first in the next game. They may wait until after sideboarding to make the decision. If the previous game was a draw, the player who decided to play or draw at the beginning of the drawn game chooses."
    },
    {
      "number": "2.3",
      "title": "Pregame Procedures",
      "content": "The following steps must be performed in a timely manner before each game begins:\n\n1. If sideboarding is allowed, players may remove cards from their decks and add cards from their sideboards. 2. Players shuffle their decks. Steps 1 and 2 may be repeated. 3. Players present their decks to their opponents for additional shuffling. The sideboard (if any) is also presented at this time. 4. If a companion is being used, it is noted. After the first game, the companion does not need to be noted again; it is assumed to be in use until rescinded. 5. The appropriate player must decide whether to play first or second at this point, if they haven’t done so already (see section 2.2). 6. Each player draws seven cards. Optionally, these cards may be dealt face down on the table. 7. Each player, in turn order, may take mulligans. (Rules on mulligans can be found in the Magic Comprehensive Rules, rule 103.4). If a player takes a mulligan, they shuffle again and repeat the presentation process described above.\n\nThe game is considered to have begun once all players have completed taking mulligans. Pregame procedures may be performed before time for the match has officially begun."
    },
    {
      "number": "2.4",
      "title": "End-of-Match Procedure",
      "content": "Once the game is complete, players may not leave the table until the result of the match is recorded unless they are doing so to record the result.\n\nIf the match time limit is reached before a winner is determined, the player whose turn it is finishes their turn and five additional turns are played in total. This usually means that one player takes three turns and the other two, but a player taking extra turns may affect this. If the active player has already indicated that they would like to pass the turn when the time limit is reached, that is considered to be in the next turn. Team tournaments featuring multiple players playing together (such as Two-Headed Giant) use three turns instead of five.\n\nOnce time is called, no new games should begin.\n\nIf the game is incomplete at the end of additional turns, the game is considered a draw.\n\nIf a judge assigned a time extension (because of a long ruling, deck check, or other reason) the end-of-match procedure does not begin until the end of the time extension. In single-elimination rounds, matches may not end in a draw. If all players have equal game wins at the end of additional turns, the player with the highest life total wins the current game. In the event all players have equal life totals (or are between games and the game wins are tied), the game/match continues with an additional state- based action: if a player does not have the highest life total, they lose the game. Two-Headed Giant teams are treated as a single player for determining a game winner."
    },
    {
      "number": "2.5",
      "title": "Conceding or Intentionally Drawing Games or Matches",
      "content": "Until the result of a match has been recorded, players may concede or mutually agree to a draw in that game or match. If the conceding player won a game in the match, the match must be reported as 2-1. Intentional draws where no games were played are always reported as 0-0-3 in EventLink. Players may not agree to a concession or draw in exchange for any reward or incentive. Doing so will be considered Bribery (see section 5.2).\n\nIf a player refuses to play, it is assumed that they have conceded the match."
    },
    {
      "number": "2.6",
      "title": "Time Extensions",
      "content": "If a judge pauses a match for more than one minute while the round clock is running, they should extend the match time appropriately. If the match was interrupted to perform a deck check, players are awarded time equal to the time the deck check took plus three minutes. Feature matches at a tournament with online coverage receive a time extension equal to three minutes plus time elapsed in the round when players reach their table. This is not necessary if feature matches are being timed separately.\n\nCertain slow play penalties add turns rather than a time extension. These additional turns are added to the end-of- match additional turns."
    },
    {
      "number": "2.7",
      "title": "Deck Registration",
      "content": "Players are required to register their decks and sideboards (if applicable) in Competitive and Professional Rules Enforcement Level tournaments. The Head Judge may require registration in Regular Rules Enforcement Level tournaments.\n\nRegistered decklists record the original composition of each deck and sideboard (if applicable). Once your decklist has been accepted by a Tournament Official it may not be altered. If electronic decklists are used, decklists cannot be altered after the date and time that decklists are required to be submitted.\n\nIn Constructed tournaments, decklists must be submitted to a tournament official prior to the start of the tournament. In Limited tournaments, decklists must be submitted prior to the start of the first round in which that player participates.\n\nPlayers have the right to request to see their decklist between matches. Such a request will be honored if logistically possible.\n\nGenerally, decklists are not public information and are not shared with other players during a tournament. At Professional Rules Enforcement Level tournaments (World Championship, Pro Tour, Limited Championship, Spotlight Series, Regional Championships), opponents’ decklists will be provided to players.\n\nAdditional information regarding digital decklists can be found in section 2.12 – Electronic Devices."
    },
    {
      "number": "2.8",
      "title": "Deck Checks",
      "content": "Deck checks must be performed at all Competitive and Professional Rules Enforcement Level tournaments, and the Head Judge has the option to perform deck checks at Regular Rules Enforcement Level tournaments. At least ten percent of all decks should be checked over the course of the tournament. A full deck check should not be performed if a player has drawn an opening hand and potentially made mulligan decisions."
    },
    {
      "number": "2.9",
      "title": "Appeals to the Head Judge",
      "content": "If a player disagrees with a judge’s ruling, they may appeal the ruling to the Head Judge. In larger, Premier-level tournaments (such as World Championship, Pro Tour, Limited Championship, Spotlight Series, and Regional Championships), with prior approval, the Head Judge may designate additional Appeals Judges who are also empowered to hear appeals. They will be wearing the same uniform as the Head Judge.\n\nPlayers may not appeal before the full ruling is made by the responding floor judge. Rulings made by the Head Judge or designated Appeals Judges are final."
    },
    {
      "number": "2.10",
      "title": "Dropping from a Tournament",
      "content": "Players may drop from a tournament at any time. If a player drops from a tournament before the first round of play has started, they are considered to have not participated in the tournament and will not be listed in the finish order. Players choosing to drop from a tournament must inform the Scorekeeper by the means provided for that tournament before the pairings for the next round are generated. Players wanting to drop after the Scorekeeper begins pairing for the next round will be paired for that round. If a player does not show up for their match, they will be automatically dropped from the tournament unless they report to the Scorekeeper. Players that repeatedly and/or intentionally drop from tournaments without informing the scorekeepers of those tournaments may be the subject of penalties up to and including suspension. Players who drop during limited tournaments own the cards that they correctly have in their possession at that time. This includes any unopened or partially drafted booster packs.\n\nIf a player drops from a tournament after a cut has been made, no other player is advanced as a replacement. If the remaining part of the tournament is single elimination, the highest ranked remaining player receives a bye for the next round instead.\n\nPlayers who have dropped may reenter a tournament at the discretion of the Head Judge. Players may not reenter a portion of the tournament that requires a deck built during a construction period that the player missed. Players may not reenter a tournament after any cut has been made.\n\nPlayers may not drop from a tournament in exchange for or influenced by the offer of any reward or incentive. Doing so is considered Bribery (see section 5.2)."
    },
    {
      "number": "2.11",
      "title": "Taking Notes",
      "content": "Players are allowed to take written notes during a match and may refer to those notes while that match is in progress. At the beginning of a match, each player’s note sheet must be empty and must remain visible throughout the match. Players do not have to explain or reveal notes to other players. Judges may ask to see a player’s notes and/or request that the player explain their notes.\n\nPlayers may not refer to other notes, including notes from previous matches, during games.\n\nBetween games, players may refer to a brief set of notes made before the match. They are not required to reveal these notes to their opponents. These notes must be removed from the play area before the beginning of the next game. Excessive quantities of notes (more than a sheet or two) are not allowed and may be penalized as slow play. In tournaments where opponents’ decklists are provided to players, players are not permitted to transcribe their opponent’s entire decklist as part of their notes for the match.\n\nThe use of electronic devices to take and refer to notes is permitted at Regular Rules Enforcement Level (see section 2.12).\n\nPlayers and spectators (exception: authorized press) may not make notes while drafting. Players may not reference any outside notes during drafting, card pool registration, or deck construction. Players may refer to Oracle text at any time. They must do so publicly and in a format which contains no other strategic information. Consulting online sources, such as gatherer.wizards.com, is allowed at Regular Rules Enforcement Level even if they contain a small amount of strategic information. If a player wishes to view Oracle text in private, they must ask a judge.\n\nArtistic modifications to cards that indirectly provide minor strategic information are acceptable. The Head Judge is the final arbiter on what cards and notes are acceptable for a tournament."
    },
    {
      "number": "2.12",
      "title": "Electronic Devices",
      "content": "Electronic devices are permitted, but players may not use them to access information that contains substantial strategic advice. For events that use digital decklists, players may only access the decklists of other players prior to the start of a game or in between games. Digital decklists may not be referenced during games. Device use during a match other than brief personal calls must be visible to all players. Players wishing to view information privately on electronic devices during matches must request permission from a judge. At Competitive and Professional Rules Enforcement Level during drafting and deck construction, players may not use electronic devices capable of taking and storing notes, communicating with other people, or accessing the internet.\n\nThe Head Judge or Tournament Organizer of a tournament may further restrict or forbid the use of electronic devices during matches."
    },
    {
      "number": "2.13",
      "title": "Video Coverage",
      "content": "Some Competitive and Professional Rules Enforcement Level tournaments use video for live streaming or replay broadcast of matches. Players may decline to appear on camera; however, players in the playoff matches of Professional Rules Enforcement Level tournaments may not decline to appear on camera. Video commentators are considered spectators for the purpose of the tournament but may talk during the match as long as they can’t be heard by players being covered. They are responsible for behaving respectfully to all tournament participants during coverage.\n\nSpectators are also permitted to record matches provided that they do so unobtrusively.\n\nThe Head Judge of a World Championship, Pro Tour, or Limited Championship tournament may, in their sole discretion, use video replay to assist in making rulings during a match. Video replays may not be used to assist in making rulings in tournaments other than a World Championship, Pro Tour, or Limited Championship tournament. Players may not request that a judge consult a video replay. Video replays may also be used for investigative purposes at a later time."
    }
  ]
}